Repository: pbrezina/my-scripts
Catalog: po/*.po
Languages: gu, uk_ua

source: SELinux prevented the http daemon from $ACCESS files stored on a CIFS filesystem. CIFS (Windows Network Filesystem) is a network filesystem commonly used on Windows / Linux systems. The http daemon attempted to read one or more files or directories from a mounted filesystem of this type. As CIFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the http daemon to read files from a CIFS filesystem this access attempt could signal an intrusion attempt.
gu: SELinux એ ftp ડિમનને NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોમાંથી લખવાથી બચાવેલ છે. NFS (Network Filesystem) એ Unix / Linux સિસ્ટમો પર સામાન્ય રીતે વાપરવામાં આવતી નેટવર્ક ફાઈલસિસ્ટમ છે. ftp ડિમને આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમમાંથી એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓ વાંચવાનું પસંદ કરેલ છે. NFS ફાઈલસિસ્ટમો fine-grained SELinux લેબલીંગને આધાર આપતું નહિં હોવાથી, ફાઈલસિસ્ટમમાંની બધી ફાઈલો અને ડિરેક્ટરીઓને સરખો સુરક્ષા સંદર્ભ હશે. જો તમે ftp ડિમનને NFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે રૂપરેખાંકિત નહિં કરેલ હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: SELinux prevented the http daemon from $ACCESS files stored on a NFS filesytem.
gu: SELinux એ ftp ડિમનને $ACCESS ફાઈલોથી બચાવેલ છે કે જેઓ NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ છે.

source: SELinux prevented the http daemon from $ACCESS files stored on a NFS filesystem. NFS (Network Filesystem) is a network filesystem commonly used on Unix / Linux systems. The http daemon attempted to read one or more files or directories from a mounted filesystem of this type. As NFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the http daemon to read files from a NFS filesystem this access attempt could signal an intrusion attempt.
gu: SELinux એ ftp ડિમનને NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોમાંથી લખવાથી બચાવેલ છે. NFS (Network Filesystem) એ Unix / Linux સિસ્ટમો પર સામાન્ય રીતે વાપરવામાં આવતી નેટવર્ક ફાઈલસિસ્ટમ છે. ftp ડિમને આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમમાંથી એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓ વાંચવાનું પસંદ કરેલ છે. NFS ફાઈલસિસ્ટમો fine-grained SELinux લેબલીંગને આધાર આપતું નહિં હોવાથી, ફાઈલસિસ્ટમમાંની બધી ફાઈલો અને ડિરેક્ટરીઓને સરખો સુરક્ષા સંદર્ભ હશે. જો તમે ftp ડિમનને NFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે રૂપરેખાંકિત નહિં કરેલ હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: SELinux is preventing the $SOURCE from using potentially mislabeled files ($TARGET_PATH).
gu: SELinux એ $SOURCE ને સંભવિતપણે ખોટી રીતે લેબલ થયેલ ફાઈલો ($TARGET_PATH) વાપરવાથી બચાવી રહ્યું છે.

source: SELinux has denied $SOURCE access to potentially mislabeled file(s) ($TARGET_PATH). This means that SELinux will not allow $SOURCE to use these files. It is common for users to edit files in their home directory or tmp directories and then move (mv) them to system directories. The problem is that the files end up with the wrong file context which confined applications are not allowed to access.
gu: SELinux એ સંભવિત ખોટી જોડણીવાળી ફાઈલો ($TARGET_PATH) ને $SOURCE વપરાશ નામંજૂર કર્યો છે. આનો અર્થ એ થાય કે SELinux એ $SOURCE ને આ ફાઈલો વાપરવા માટે પરવાનગી આપશે નહિં. વપરાશકર્તાઓ માટે તેમની ઘર ડિરેક્ટરીઓ અથવા tmp ડિરેક્ટરીઓમાં ફેરફાર કરવાનું સામાન્ય છે અને પછી તેમને સિસ્ટમ ડિરેક્ટરી વૃક્ષમાં ખસેડવાનું (mv) પણ સામાન્ય છે. સમસ્યા એ છે કે તેઓ ફાઈલ સંદર્ભથી અંત થાય છે કે જેને અનિર્ણિત કાર્યક્રમો વાપરવા માટે પરવાનગી નથી.

source: If you want $SOURCE to access this files, you need to relabel them using restorecon -v '$TARGET_PATH'. You might want to relabel the entire directory using restorecon -R -v '$TARGET_DIR'.
gu: જો તમે $SOURCE ને આ ફાઈલો વાપરવા માંગો, તો તમારે તેમને restorecon -v $TARGET_PATH ની મદદથી પુનઃલેબલ કરવાની જરૂર છે. તમે કદાચ આખી ડિરેક્ટરીને restorecon -R -v $TARGET_DIR ની મદદથી પુનઃલેબલ કરવા ઈચ્છતા હશો.

source: SELinux has denied the $SOURCE from binding to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE is supposed to be allowed to listen on this port, you can use the semanage command to add this port to a inetd_child_port_t type. If you think this is the default please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against the selinux-policy package. If $SOURCE is not supposed to bind to this port, this could signal a intrusion attempt.
gu: SELinux એ $SOURCE ને નેટવર્ક પોર્ટ $PORT_NUMBER સાથે જોડાવાથી નામંજૂર કરેલ છે કે જેને SELinux પ્રકાર તેની સાથે સંકળાયેલ નથી. જો $SOURCE એ આ પોર્ટ પર જોડાવા માટે માન્ય હોવું જોઈએ, તો તમે આ પોર્ટને પોર્ટ પ્રકારમાં ઉમેરવા માટે semanage આદેશ વાપરી શકો કે જેને $SOURCE_TYPE જોડાઈ શકે. <i>semanage port -L</i> બધા પોર્ટ પ્રકારોની યાદી આપશે. મહેરબાની કરીને selinux-policy પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો. જો $SOURCE એ આ પોર્ટ સાથે બંધાવું નહિં જોઈએ, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want to allow $SOURCE to bind to this port semanage port -a -t inetd_child_port_t -p PROTOCOL $PORT_NUMBER Where PROTOCOL is tcp or udp.
gu: જો તમે $SOURCE ને આ પોર્ટ સાથે બંધાવા માટે પરવાનગી આપવા માંગો semanage port -a -t inetd_child_port_t -p PROTOCOL $PORT_NUMBER કે જ્યાં PROTOCOL એ tcp અથવા udp છે.

source: SELinux is preventing $SOURCE ($SOURCE_TYPE) "$ACCESS" to $TARGET_PATH ($TARGET_TYPE). The SELinux type $TARGET_TYPE, is a generic type for all files in the directory and very few processes (SELinux Domains) are allowed to write to this SELinux type. This type of denial usual indicates a mislabeled file. By default a file created in a directory has the gets the context of the parent directory, but SELinux policy has rules about the creation of directories, that say if a process running in one SELinux Domain (D1) creates a file in a directory with a particular SELinux File Context (F1) the file gets a different File Context (F2). The policy usually allows the SELinux Domain (D1) the ability to write, unlink, and append on (F2). But if for some reason a file ($TARGET_PATH) was created with the wrong context, this domain will be denied. The usual solution to this problem is to reset the file context on the target file, restorecon -v '$TARGET_PATH'. If the file context does not change from $TARGET_TYPE, then this is probably a bug in policy. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against the selinux-policy package. If it does change, you can try your application again to see if it works. The file context could have been mislabeled by editing the file or moving the file from a different directory, if the file keeps getting mislabeled, check the init scripts to see if they are doing something to mislabel the file.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) "$ACCESS" ને $TARGET_PATH ($TARGET_TYPE) થી બચાવી રહ્યું છે. SELinux પ્રકાર %TARGET_TYPE, એ ડિરેક્ટરીમાંની બધી ફાઈલો માટે સામાન્ય પ્રકાર છે અને ખૂબ થોડી પ્રક્રિયાઓ (SELinux ડોમેઈનો) આ SELinux પ્રકાર લખવા માટે માન્ય છે. આ પ્રકારની નામંજૂરી સામાન્ય રીતે ખોટી લેબલવાળી ફાઈલો સૂચવે છે. મૂળભૂત રીતે ફાઈલ ડિરેક્ટરીમાં બનેલ છે કે જેને પિતૃ ડિરેક્ટરીનો સંદર્ભ મળે છે, પરંતુ SELinux પોલિસીને ડિરેક્ટરીઓની બનાવટ માટેના નિયમો છે, કે જે કહે છે કે શું પ્રક્રિયા એક SELinux Domain (D1) પર ચાલી રહી છે તે ડિરેક્ટરીમાં ચોક્કસ SELinux ફાઈલ સંદર્ભ (F1) છે કે જે ફાઈલ અલગ ફાઈલ સંદર્ભ (F2) મેળવે છે. પોલિસી સામાન્ય રીતે SELinux ડોમેઈન (D1) ને (F2) પર લખવા અથવા ઉમેરવા માટેની સમર્થતા પૂરી પાડે છે. પરંતુ જો કોઈ કારણોસર ફાઈલ ($TARGET_PATH) ખોટા સંદર્ભ સાથે બનાવાયેલ હતી, તો આ ડોમેઈન નામંજૂર થઈ જશે. આ સમસ્યાનો સામાન્ય ઉકેલ એ છે કે લક્ષ્ય ફાઈલ પર ફાઈલ સંદર્ભ પુનઃસુયોજિત કરવો, restorecon -v '$TARGET_PATH'. જો ફાઈલ સંદર્ભ $TARGET_TYPE માંથી બદલાય નહિં, તો પછી આ કદાચ પોલિસીમાં ભૂલ હોઈ શકે. મહેરબાની કરીને selinux-policy પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો. જો તે બદલાય, તો તમે તમારા કાર્યક્રમને તે કામ કરે છે તે નહિં તે જોવા માટે ફરીથી પ્રયાસ કરી શકો છો. ફાઈલ સંદર્ભ તે ફાઈલમાં ફેરફાર કરીને અથવા ફાઈલને અન્ય ડિરેક્ટરીમાં ખસેડીને કદાચ ખોટા લેબલવાળો થઈ ગયો હશે, init સ્ક્રિપ્ટો ચકાસો એ જોવા માટે કે તેઓ કંઈક ફાઈલને ખોટું લેબલ આપવા માટે કરી રહી તો નથી.

source: You can attempt to fix file context by executing restorecon -v '$TARGET_PATH'
gu: તમે restorecon -v '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો

source: SELinux prevented $SOURCE from mounting a filesystem on the file or directory "$TARGET_PATH" of type "$TARGET_TYPE". By default SELinux limits the mounting of filesystems to only some files or directories (those with types that have the mountpoint attribute). The type "$TARGET_TYPE" does not have this attribute. You can change the label of the file or directory.
gu: SELinux એ $SOURCE ને "$TARGET_TYPE" પ્રકારની "$TARGET_PATH" ફાઈલ અથવા ડિરેક્ટરી માઉન્ટ કરવાથી બચાવેલ છે. મૂળભૂત રીતે SELinux ફાઈલસિસ્ટમોના માઉન્ટિંગને અણુક ફાઈલો અથવા ડિરેક્ટરીઓ પૂરતું જ મર્યાદા મૂકે છે (માઉન્ટબિંદુ લક્ષણ હોય તે પ્રકારની માટે જ). પ્રકાર "$TARGET_TYPE" ને આ લક્ષણ નથી. તમે ફાઈલ અથવા ડિરેક્ટરીના લેબલને બદલી શકો છો.

source: Changing the file_context to mnt_t will allow mount to mount the file system: "chcon -t mnt_t '$TARGET_PATH'." You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t mnt_t '$TARGET_PATH'"
gu: file_context ને mnt_t માં બદલવાનું માઉન્ટને ફાઈલ સિસ્ટમ માઉન્ટ કરવા માટે પરવાનગી આપશે: "chcon -t mnt_t '$TARGET_PATH'." તમારે સિસ્ટમ પર મૂળભૂત ફાઈલ સંદર્ભ ફાઈલો પણ બદલવી જ પડશે તેમને પૂરા પુનઃલેબલ પર જાળવવા માટે. "semanage fcontext -a -t mnt_t '$TARGET_PATH'"

source: SELinux is preventing the named daemon from writing to the zone directory
gu: SELinux એ named ડિમનને ઝોન ડિરેક્ટરીમાંથી લખવાથી બચાવી રહ્યું છે

source: SELinux has denied the named daemon from writing zone files. Ordinarily, named is not required to write to these files. Only secondary servers should be required to write to these directories. If this machine is not a secondary server, this could signal a intrusion attempt.
gu: SELinux એ ઝોન ફાઈલોમાં લખવાથી named ડિમનને નામંજૂર કરેલ છે. સામાન્ય રીતે, named એ આ ફાઈલો લખવા માટે જરૂરી નથી. માત્ર ગૌણ સર્વરો આ ડિરેક્ટરીઓ લખવા માટે માન્ય હોવ જોઈએ. જો આ મશીન ગૌણ સર્વર નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want named to run as a secondary server and accept zone transfers you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે named ને ગૌણ સર્વર તરીકે ચલાવવા માંગો અને ઝોન પરિવહનો સ્વીકારવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: Domain Name Service
gu: ડોમેઈન નામ સેવા

source: SELinux is preventing the nfs daemon from serving r/o local files to remote clients.
gu: SELinux એ nfs ડિમનને દૂરસ્થ ક્લાઈન્ટોને સ્થાનિક ફાઈલો લખવાની પરવાનગી આપવાથી બચાવી રહ્યું છે.

source: SELinux has preventing the nfs daemon (nfsd) from read files on the local system. If you have not exported these file systems, this could signals an intrusion.
gu: SELinux એ nfs ડિમનને (nfsd) સ્થાનિક સિસ્ટમો પર વંચાયેલ ફાઈલોથી બચાવેલ છે. જો તમે કોઈપણ ફાઈલ સિસ્ટમોની નિકાસ નહિં કરેલ હોય, તો આ ઘૂંસણખોરીનો સંકેત આપી શક્યું હશે.

source: If you want to export file systems using nfs you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1".
gu: જો તમે nfs ની મદદથી ફાઈલ સિસ્ટમોની નિકાસ કરવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1".

source: SELinux is preventing the nfs daemon from allowing remote clients to write local files.
gu: SELinux એ nfs ડિમનને દૂરસ્થ ક્લાઈન્ટોને સ્થાનિક ફાઈલો લખવાની પરવાનગી આપવાથી બચાવી રહ્યું છે.

source: SELinux has preventing the nfs daemon (nfsd) from writing files on the local system. If you have not exported any file systems (rw), this could signals an intrusion.
gu: SELinux એ nfs ડિમનને (nfsd) ફાઈલોને સ્થાનિક સિસ્ટમ પર લખવાથી બચાવી રહ્યું છે. જો તમે કોઈપણ ફાઈલ સિસ્ટમોની (rw) નિકાસ કરી નહિં હોય, તો આ ઘૂંસણખોરીના પ્રવેશનો સંકેત કરી શક્યું હશે.

source: If you want to export writable file systems using nfs you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1".
gu: જો તમે લખી શકાય તેવી ફાઈલ સિસ્ટમોને nfs ની મદદથી નિકાસ કરવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1".

source: SELinux is preventing the ppp daemon from inserting kernel modules.
gu: SELinux એ ppp ડિમનને કર્નલ મોડ્યુલો દાખલ કરવાથી બચાવી રહ્યું છે.

source: SELinux has denied the Point-to-Point Protocol daemon from inserting a kernel module. If pppd is not setup to insert kernel modules, this probably signals a intrusion attempt.
gu: SELinux એ Point-to-Point પ્રોટોકોલ ડિમનને કર્નલ મોડ્યુલો દાખલ કરવાથી નામંજૂર કરેલ છે. જો pppd એ કર્નલ મોડ્યુલો દાખલ કરવા માટે સુયોજિત થયેલ નહિં હોય, તો આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત કરશે.

source: If you want ppp to be able to insert kernel modules you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે ppp ને કર્નલ મોડ્યુલો દાખલ કરવા માટે સમર્થ કરવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: Networking
gu: નેટવર્કીંગ

source: SELinux is preventing $SOURCE ($SOURCE_TYPE) "$ACCESS" on $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ $SOURCE ($SOURCE_TYPE) "$ACCESS" ને $TARGET_PATH ($TARGET_TYPE) પર અટકાવી રહ્યું છે.

source: SELinux denied prelink $ACCESS on $TARGET_PATH. The prelink program is only allowed to manipulate files that are identified as executables or shared libraries by SELinux. Libraries that get placed in lib directories get labeled by default as a shared library. Similarly, executables that get placed in a bin or sbin directory get labeled as executables by SELinux. However, if these files get installed in other directories they might not get the correct label. If prelink is trying to manipulate a file that is not a binary or share library this may indicate an intrusion attack.
gu: SELinux એ prelink $ACCESS ને $TARGET_PATH પર નામંજૂર કરી. prelink કાર્યક્રમ એ માત્ર ફાઈલોની જાળવણી કરવા માટે માન્ય છે કે જેઓ એક્ઝેક્યુટેબલો અથવા SELinux દ્વારા વહેંચાયેલ લાઈબ્રેરીઓ તરીકે ઓળખાયેલ છે. લાઈબ્રેરીઓ કે જે lib ડિરેક્ટરીઓમાં મૂકવામાં આવેલ છે તેઓ વહેંચાયેલ ડિરેક્ટરી તરીકે લેબલ આપવામાં આવેલ છે. આ જ રીતે એક્ઝેક્યુટેબલો કે જે bin અથવા sbin ડિરેક્ટરીમાં મૂકવામાં આવેલ છે તેઓને SELinux દ્વારા એક્ઝેક્યુટેબલો તરીકેનું લેબલ આપવામામં આવેલ છે. છતાં, જો આ ફાઈલો અન્ય ડિરેક્ટરીઓમાં સ્થાપિત કરવામાં આવે ત્યારે તેઓ સાચું લેબલ કદાચ નહિં પણ મેળવે. જોજ prelink એ ફાઈલની જાળવણી કરવાનો પ્રયત્ન કરે કે જે બાઈનરી કે વહેંચાયેલ લાઈબ્રેરી નહિં હોય તો આ ઘૂંસણખોરી હુમલાનો અણસાર આપી શકે.

source: You can alter the file context by executing "chcon -t bin_t '$TARGET_PATH'" or "chcon -t lib_t '$TARGET_PATH'" if it is a shared library. If you want to make these changes permanent you must execute the semanage command. "semanage fcontext -a -t bin_t '$TARGET_PATH'" or "semanage fcontext -a -t shlib_t '$TARGET_PATH'". If you feel this executable/shared library is in the wrong location please file a bug against the package that includes the file. If you feel that SELinux should know about this file and label it correctly please file a bug against <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">SELinux policy</a>.
gu: તમે "chcon -t bin_t '$TARGET_PATH'" અથવા "chcon -t lib_t '$TARGET_PATH'" ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો. જો તમે આ ફેરફારોને કાયમી કરવા માંગો તો તમારે semanage આદેશ ચલાવવો જ પડશે. "semanage fcontext -a -t bin_t '$TARGET_PATH'" અથવા "semanage fcontext -a -t shlib_t '$TARGET_PATH'". જો તમને એવું લાગે કે આ એક્ઝેક્યુટેબલ/વહેંચાયેલ લાઈબ્રેરી એ ખોટી જગ્યાએ છે તો મહેરબાની કરીને પેકેજ વિરુદ્ધ ભૂલનો અહેવાલ જમા કરો કે જે ફાઈલનો સમાવેશ કરે, જો તમને એવું લાગે કે SELinux ને આ ફાઈલ વિશે ખબર પડવી જોઈએ અને તે તેને યોગ્ય રીતે લેબલ કરે તો મહેરબાની કરીને <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">SELinux પોલિસી</a> વિરુદ્ધ ભૂલનો અહેવાલ જમા કરો.

source: SELinux denied access to $TARGET_PATH requested by $SOURCE. $TARGET_PATH has a context used for sharing by different program. If you would like to share $TARGET_PATH from $SOURCE also, you need to change its file context to public_content_t. If you did not intend to this access, this could signal a intrusion attempt.
gu: SELinux એ $TARGET_PATH નો $SOURCE દ્વારા અરજી થયેલ વપરાશ નામંજૂર કર્યો. $TARGET_PATH ને વિવિધ કાર્યક્રમો દ્વારા વિભાજતો સંદર્ભ વપરાયેલ છે. જો તમે $TARGET_PATH ને $SOURCE માંથી પણ વહેંચવા માંગો, તો તમારે તેનો ફાઈલ સંદર્ભ public_content_t માં બદલવાની જરૂર છે. જો તમે આ વપરાશ રાખવાની ઈચ્છા દાખવો નહિં, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હશે.

source: You can alter the file context by executing chcon -t public_content_t '$TARGET_PATH'
gu: તમે chcon -t public_content_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો

source: SELinux prevented $SOURCE from $ACCESS files stored in directories marked with the default context.
gu: SELinux એ $SOURCE ને $ACCESS ફાઈલોથી બચાવેલ છે કે જે મૂળભૂત સંદર્ભ સાથે ચિહ્નિત થયેલ ડિરેક્ટરીઓમાં સંગ્રહાયેલ છે.

source: SELinux prevented $SOURCE from $ACCESS files stored in directories marked with the default context. $SOURCE attempted to read one or more files or directories which are marked with the default context. Confined domains usually do not need to access these directories, this access attempt could signal an intrusion attempt. If this application and other confined applications need to access these files you can either change the file context of the files or set a boolean.
gu: SELinux એ મૂળભૂત સંદર્ભ સાથે ચિહ્નિત થયેલ ડિરેક્ટરીઓમાં સંગ્રહાયેલ $ACCESS ફાઈલોથી $SOURCE ને બચાવેલ છે. $SOURCE એક અથવા વધુ ફાઈલો વાંચવા માટે લેવાયેલ છે કે જેઓ મૂળભૂત સંદર્ભથી ચિહ્નિત થયેલ છે. કાયદાકીય ડોમેઈનોને સામાન્ય રીતે આ ડિરેક્ટરીઓ વાપરવાની જરૂર રહેતી નથી, આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત. જો આ કાર્યક્રમ અને અન્ય કાયદાકીય કાર્યક્રમોને આ ફાઈલો વાપરવાની જરૂર હોય તો તમે ક્યાં તો આ ફાઈલોનો ફાઈલ સંદર્ભ બદલી શકો અથવા બુલિયન સુયોજિત કરી શકો છો.

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be a mislabeled. $TARGET_PATH default SELinux type is <B>$MATCHTYPE</B>, but its current type is <B>$TARGET_TYPE</B>. Changing this file back to the default type, may fix your problem. <p> File contexts can be assigned to a file in the following ways. <ul> <li>Files created in a directory receive the file context of the parent directory by default. <li>The SELinux policy might override the default label inherited from the parent directory by specifying a process running in context A which creates a file in a directory labeled B will instead create the file with label C. An example of this would be the dhcp client running with the dhclient_t type and creates a file in the directory /etc. This file would normally receive the etc_t type due to parental inheritance but instead the file is labeled with the net_conf_t type because the SELinux policy specifies this. <li>Users can change the file context on a file using tools such as chcon, or restorecon. </ul> This file could have been mislabeled either by user error, or if an normally confined application was run under the wrong domain. <p> However, this might also indicate a bug in SELinux because the file should not have been labeled with this type. <p> If you believe this is a bug, please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this package.
gu: SELinux એ $SOURCE દ્વારા અરજી થયેલ વપરાશની નામંજૂરી આપી. $TARGET_PATH એ ખોટી રીતે લેબલ થયેલ હોઈ શકે. $TARGET_PATH મૂળભૂત SELinux પ્રકાર <B>$MATCHTYPE</B> છે, પરંતુ તેનો વર્તમાન પ્રકાર <B>$TARGET_TYPE</B> છે. આ ફાઈલને મૂળભૂત પ્રકારમાં બદલવાનું, તમારી સમસ્યા સુધારી શકશે. <p> ફાઈલ સંદર્ભો ફાઈલને નીચેના માર્ગોએ સોંપી શકાશે. <ul> <li>ડિરેક્ટરીમાં બનાવેલ ફાઈલો પિતૃ ડિરેક્ટરીનો મૂળભૂત રીતે ફાઈલ સંદર્ભ મેળવે. <li>SELinux પોલીસિ પિતૃ ડિરેક્ટરીમાંથી બોલાવીને મૂળભૂત લેબલ પર ફરીથી લખી શકશે સંદર્ભ A માં ચાલી રહેલ પ્રક્રિયા સ્પષ્ટ કરીને કે જે B લેબલવાળી ડિરેક્ટરીમાં ફાઈલ બનાવે છે તે તેની જગ્યાએ લેબલ C સાથેની ફાઈલ બનાવશે. આનું ઉદાહરણ dhcp ક્લાઈન્ટ હોઈ શકે કે જે dhclient_t પ્રકાર સાથે ચલાવી રહ્યું હોય અને ડિરેક્ટરી /etc માં ફાઈલ બનાવો. આ ફાઈલ સામાન્ય રીતે etc_t પ્રકાર મેળવવી જોઈએ સંભવિત બોલાવાને કારણે પરંતુ તેની જગ્યાએ ફાઈલ એ net_conf_t પ્રકાર સાથે લેબલ થયેલ હોય છે કારણ કે SELinux પોલીસિ આને સ્પષ્ટ કરે છે. <li>વપરાશકર્તાઓ ફાઈલ પરનો ફાઈલ સંદર્ભ બદલી શકે છે chcon, અથવા restorecon જેવા સાધનોની મદદથી. </ul> આ ફાઈલ ક્યાં તો વપરાશકર્તા ભૂલને કારણે ખોટી રીતે લેબલ થઈ ગયેલ હોઈ શકે, અથવા જો સામાન્ય રીતે શુદ્ધ થયેલ કાર્યક્રમની મદદથી કે જે ખોટા ડોમેઈન હેઠળ ચાલી રહ્યો હતો. <p> છતાંય, આ SELinux માં પણ ભૂલ બતાતવી શકશે કારણ કે ફાઈલ આ પ્રકાર સાથે લેબલ થયેલ હોવી જોઈએ નહિં. <p> જો તમે એમ માનો કે આ ભૂલ છે, તો મહેરબાની કરીને આ પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલ અહેવાલ</a> જમા કરો.

source: You can restore the default system context to this file by executing the restorecon command. restorecon '$TARGET_PATH', if this file is a directory, you can recursively restore using restorecon -R '$TARGET_PATH'.
gu: તમે મૂળભૂત સિસ્ટમ સંદર્ભ આ ફાઈલમાં restorecon આદેશ ચલાવીને પુનઃસંગ્રહી શકો. restorecon '$TARGET_PATH', જો આ ફાઈલ એ ડિરેક્ટરી હોય, તો તમે પુનરાવર્તિત રીતે restorecon -R '$TARGET_PATH' ની મદદથી પુનઃસંગ્રહી શકો.

source: SELinux is preventing rsync ($SOURCE) "$ACCESS" to $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ rsync ($SOURCE) "$ACCESS" ને $TARGET_PATH ($TARGET_TYPE) થી બચાવી રહ્યું છે.

source: SELinux denied rsync access to $TARGET_PATH. If this is a RSYNC repository it has to have a file context label of rsync_data_t. If you did not intend to use $TARGET_PATH as a rsync repository it could indicate either a bug or it could signal a intrusion attempt.
gu: SELinux એ $TARGET_PATH નો rsync વપરાશ નામંજૂર કર્યો. જો આ RSYNC રીપોઝીટરી હોય તો તેને rsync_data_t નું ફાઈલ સંદર્ભ લેબલ હોવું જોઈએ. જો તમે $TARGET_PATH ને rsync રીપોઝીટરી તરીકે વાપરવાનો હેતુ રાખ્યો નહિં હોય તો તે ક્યાં તો ભૂલ તરીકે સૂચવી શક્યું હોત અથવા તે ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: You can alter the file context by executing chcon -R -t rsync_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t rsync_data_t '$TARGET_PATH'"
gu: તમે chcon -R -t rsync_data_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે સિસ્ટમ પર મૂળભૂત ફાઈલ સંદર્ભ ફાઈલો બદલવી જ પડશે તેમને પૂરા પુનઃલેબલ પર સાચવવા માટે. "semanage fcontext -a -t rsync_data_t '$TARGET_PATH'"

source: SELinux is preventing the samba daemon from reading users' home directories.
gu: SELinux એ samba ડિમનને વપરાશકર્તાઓ ઘર ડિરેક્ટરીઓથી વાંચવાથી બચાવેલ છે.

source: SELinux has denied the samba daemon access to users' home directories. Someone is attempting to access your home directories via your samba daemon. If you only setup samba to share non-home directories, this probably signals a intrusion attempt. For more information on SELinux integration with samba, look at the samba_selinux man page. (man samba_selinux)
gu: SELinux એ વપરાશકર્તા ઘર ડિરેક્ટરીઓમાં samba ડિમનનો વપરાશ નામંજૂર કરેલ છે. કોઈક તમારા samba ડિમન મારફતે તમારી ઘર ડિરેક્ટરીઓનો વપરાશ કરવાનો પ્રયત્ન કરી રહ્યું છે. જો તમે samba ડિમનને માત્ર બિન ઘર ડિરેક્ટરીઓ વહેંચવા માટે જ સુયોજિત કરો, તો આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત. SELinux ના samba સાથેના સંકલન પર વધુ જાણકારી માટે, samba_selinux મદદ પાનાંને જુઓ. (man samba_selinux)

source: If you want samba to share home directories you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે samba ને ઘર ડિરેક્ટરીઓ વહેંચવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the samba daemon from serving r/o local files to remote clients.
gu: SELinux એ nfs ડિમનને દૂરસ્થ ક્લાઈન્ટોને સ્થાનિક ફાઈલો લખવાની પરવાનગી આપવાથી બચાવી રહ્યું છે.
