Repository: pbrezina/my-scripts
Catalog: po/*.po
Languages: gu, uk_ua

source: SELinux has preventing the samba daemon (smbd) from reading files on the local system. If you have not exported these file systems, this could signals an intrusion.
gu: SELinux ને samba ડિમનને (smbd) સ્થાનિક સિસ્ટમ પર ફાઈલો વાંચવાથી અટકાવી રહ્યું છે. જો તમે આ ફાઈલ સિસ્ટમોની નિકાસ ના કરી હોય, તો આ ઘૂંસણખોરીનો સંકેત આપી શક્યું હોત.

source: If you want to export file systems using samba you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1".
gu: જો તમે samba ની મદદથી ફાઈલ સિસ્ટમોની નિકાસ કરવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1".

source: SELinux is preventing the samba daemon from allowing remote clients to write local files.
gu: SELinux એ samba ડિમનને દૂરસ્થ ક્લાઈન્ટોને સ્થાનિક ફાઈલો લખવાની પરવાનગી આપવાથી બચાવી રહ્યું છે.

source: SELinux has preventing the samba daemon (smbd) from writing files on the local system. If you have not exported any file systems (rw), this could signals an intrusion.
gu: SELinux એ samba ડિમન (smbd) ને સ્થાનિક સિસ્ટમ પર ફાઈલો લખવાથી અટકાવી રહ્યું છે. જો તમે કોઈપણ ફાઈલ સિસ્ટમો (rw) નિકાસ કરી નહિં હોય, તો આ ઘૂંસણખોરીનો સંકેત આપી શક્યું હોત.

source: If you want to export writable file systems using samba you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1".
gu: જો તમે લખી શકાય તેવી ફાઈલ સિસ્ટમોને samba ની મદદથી નિકાસ કરવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1".

source: SELinux is preventing the samba daemon from reading nfs file systems.
gu: SELinux એ samba ડિમનને nfs ફાઈલ સિસ્ટમો વાંચવાથી બચાવી રહ્યું છે.

source: SELinux has denied the samba daemon access to nfs file systems. Someone is attempting to access an nfs file system via your samba daemon. If you did not setup samba to share nfs file systems, this probably signals a intrusion attempt.
gu: SELinux એ nfs ફાઈલ સિસ્ટમો માટે samba ડિમન વપરાશ નામંજૂર કરેલ છે. કોઈક તમારા samba ડિમન મારફતે nfs ફાઈલ સિસ્ટમનો વપરાશ કરવાનો પ્રયાસ કરી રહ્યું છે. જો તમે samba ને nfs ફાઈલ સિસ્ટમો વહેંચવા માટે સુયોજિત કરેલ નહિં હોય, તો આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want samba to share nfs file systems you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે samba ને nfs ફાઈલ સિસ્ટમો વહેંચવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing samba ($SOURCE) "$ACCESS" to $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ સામ્બા ($SOURCE) "$ACCESS" ને $TARGET_PATH ($TARGET_TYPE) થી બચાવી રહ્યું છે.

source: SELinux denied samba access to $TARGET_PATH. If you want to share this directory with samba it has to have a file context label of samba_share_t. If you did not intend to use $TARGET_PATH as a samba repository it could indicate either a bug or it could signal a intrusion attempt.
gu: SELinux એ $TARGET_PATH નો સામ્બા વપરાશ નામંજૂર કર્યો. જો તમે આ ડિરેક્ટરીને સામ્બા સાથે વહેંચવા માંગો તો તેને samba_share_t નું ફાઈલ સંદર્ભ લેબલ હોવું જોઈએ. જો તમે $TARGET_PATH ને સામ્બા રીપોઝીટરી તરીકે વાપરવાનો હેતુ રાખ્યો નહિં હોય તો તે ક્યાં તો ભૂલ સૂચવી શક્યું હોત અથવા તે ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: You can alter the file context by executing chcon -R -t samba_share_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t samba_share_t '$TARGET_PATH'"
gu: તમે chcon -R -t samba_share_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે સિસ્ટમ પર મૂળભૂત ફાઈલ સંદર્ભ પણ બદલવું જ પડશે પૂરેપૂરા પુનઃલેબલને જાળવવા માટે. "semanage fcontext -a -t samba_share_t '$TARGET_PATH'"

source: SELinux is preventing the kernel modules from being loaded.
gu: SELinux એ કર્નલ મોડ્યુલોને લોડ થવાથી બચાવી રહ્યું છે.

source: SELinux has denied kernel module utilities from modifying kernel modules. This machine is hardened to not allow the kernel to be modified, except in single user mode. If you did not try to manage a kernel module, this probably signals an intrusion.
gu: SELinux એ કર્નલ મોડ્યુલ ઉપયોગીતાઓને કર્નલ મોડ્યુલો સુધારવાથી બચાવી રાખેલ છે. આ મશીનને કર્નલને સુધારવામાં નહિં આવે તે માટે સખત બનાવવામાં આવેલ છે, અપવાદરૂપે એક વપરાશકર્તા સ્થિતિ. જો તમે કર્નલ મોડ્યુલની વ્યવસ્થા કરવાનો પ્રયાસ કર્યો નહિં હોય, તો આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you allow the management of the kernel modules on your machine, turn off the $BOOLEAN boolean: "setsebool -P $BOOLEAN=0".
gu: જો તમે તમારા મશીન પરના કર્નલ મોડ્યુલોના વ્યવસ્થાપનને પરવાનગી આપો, તો $BOOLEAN બુલિયન બંધ કરો: "setsebool -P $BOOLEAN=0".

source: Kernel
gu: કર્નલ

source: SELinux is preventing the modification of the running policy.
gu: SELinux એ ચાલી રહેલ પોલિસીના સુધારાથી બચાવી રહ્યું છે.

source: SELinux has denied the management tools from modifying the way the SELinux policy runs. This machine is hardened if you did not run any SELinux tools, this probably signals an intrusion.
gu: SELinux એ SELinux પોલિસી જે રીતે ચાલે છે તે માર્ગ સુધારવાથી વ્યવસ્થાપન સાધનોને નામંજૂર કરેલ છે. આ મશીન મજબૂત કરવામાં આવેલ છે જો તમે કોઈપણ SELinux સાધનો ચાલુ કરેલ નહિં હોય, આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want to modify the way SELinux is running on your machine you need to bring the machine to single user mode with enforcing turned off. The turn off the secure_mode_policyload boolean: "setsebool -P secure_mode_policyload=0".
gu: જો તમે SELinux જે રીતે તમારા મશીન પર ચાલી રહ્યું છે તે બદલવા માંગો તો તમારે મશીનને એક વપરાશકર્તા સ્થિતિમાં enforcing ને બંધ કરીને લાવવાની જરૂર છે. પછી secure_mode_policyload બુલિયન બંધ કરો: "setsebool -P secure_mode_policyload=0".

source: SELinux is preventing the spamd daemon from reading users' home directories.
gu: SELinux એ spamd ડિમનને વપરાશકર્તાઓ ઘર ડિરેક્ટરીઓ વાંચવાથી બચાવી રહ્યું છે.

source: SELinux has denied the spamd daemon access to users' home directories. Someone is attempting to access your home directories via your spamd daemon. If you only setup spamd to share non-home directories, this probably signals a intrusion attempt.
gu: SELinux એ spamd ડિમનને વપરાશકર્તાઓની ઘર ડિરેક્ટરીઓ વાપરવાની મનાઈ કરેલ છે. કોઈક તમારી ઘર ડિરેક્ટરીઓને spamd ડિમન મારફતે વાપરવાનો પ્રયાસ કરી રહ્યું છે. જો તમે spamd ને માત્ર ઘર ડિરેક્ટરીઓ વહેંચવા માટે જ સુયોજિત કરો, તો આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત આપે.

source: If you want spamd to share home directories you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે spamd ને ઘર ડિરેક્ટરીઓ વહેંચવા ઈચ્છો કે તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the squid daemon from connecting to network port $PORT_NUMBER
gu: SELinux એ squid ડિમનને નેટવર્ક પોર્ટ $PORT_NUMBER સાથે જોડાવાથી બચાવી રહ્યું છે

source: SELinux has denied the squid daemon from connecting to $PORT_NUMBER. By default squid policy is setup to deny squid connections. If you did not setup squid to network connections, this could signal a intrusion attempt.
gu: SELinux એ squid ડિમનને $PORT_NUMBER સાથે જોડાવાથી નામંજૂર કરેલ છે. મૂળભૂત રીતે squid પોલિસી એ squid જોડાણોને નામંજૂર કરવા માટે સુયોજિત થયેલ છે. જો તમે squid ને નેટવર્ક જોડાણોમાં સુયોજિત કરેલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want squid to connect to network ports you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે squid ને નેટવર્ક પોર્ટો સાથે જોડવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux has denied the $SOURCE ($SOURCE_TYPE) "$ACCESS" access to device $TARGET_PATH. $TARGET_PATH is mislabeled, this device has the default label of the /dev directory, which should not happen. All Character and/or Block Devices should have a label. You can attempt to change the label of the file using restorecon '$TARGET_PATH'. If this device remains labeled device_t, then this is a bug in SELinux policy.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) "$ACCESS" વપરાશ ઉપકરણ $TARGET_PATH માટે નામંજૂર કરેલ છે. $TARGET_PATH ને ખોટું લેબલ અપાયેલ છે, આ ઉપકરણને /dev ડિરેક્ટરીનું મૂળભૂત લેબલ છે, કે જે થવું જોઈએ નહિં. બધા અક્ષર અને/અથવા બ્લોક ઉપકરણોને લેબલ હોવું જોઈએ. તમે ફાઈલનું લેબલ બદલી શકો છો restorecon '$TARGET_PATH' ની મદદથી. જો આ ઉપકરણ device_t લેબલવાળું જ રહે, તો પછી આ SELinux પોલિસીમાં ભૂલ હશે.

source: If you want the SSL Tunnel to run as a daemon you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1". You also need to tell SELinux which port SSL Tunnel will be running on. semanage port -a -t stunnel_port_t -p tcp $PORT_NUMBER
gu: જો તમે SSL ટનલને ડિમન તરીકે ચલાવવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1". તમારે SELinux ને એ પણ કહેવું પડશે કે કયા પોર્ટ પર SSL ટનલ ચાલી રહેલ હશે. semanage port -a -t stunnel_port_t -p tcp $PORT_NUMBER

source: SELinux denied $SOURCE access to $TARGET_PATH. If this is a swapfile it has to have a file context label of swapfile_t. If you did not intend to use $TARGET_PATH as a swapfile it probably indicates a bug, however it could also signal a intrusion attempt.
gu: SELinux એ $TARGET_PATH નો $SOURCE વપરાશ નામંજૂર કર્યો. જો આ સ્વેપફાઈલ હોય તો તેને swapfile_t નું ફાઈલ સંદર્ભ લેબલ હોવું જોઈએ. જો તમે $TARGET_PATH ને સ્વેપફાઈલ તરીકે વાપરવાનો હેતુ નહિં રાખ્યો હોય તો એ કદાચ ભૂલ સૂચવી શકે છે, છતાં તે ઘૂંસણખોરી પ્રવેશનો સંકેત પણ સૂચવી શક્યું હોત.

source: You can alter the file context by executing chcon -t swapfile_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t swapfile_t '$TARGET_PATH'"
gu: તમે chcon -t swapfile_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે સિસ્ટમ પર મૂળભૂત ફાઈલ સંદર્ભ ફાઈલો બદલવી જ પડશે તેમને પૂરા પુનઃલેબલ સાથે જાળવવા માટે. "semanage fcontext -a -t swapfile_t '$TARGET_PATH'"

source: SELinux prevented $SOURCE from $ACCESS files stored on a NFS filesytem.
gu: SELinux એ NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી $SOURCE ને બચાવેલ છે.

source: SELinux prevented $SOURCE from $ACCESS files stored on a NFS filesystem. NFS (Network Filesystem) is a network filesystem commonly used on Unix / Linux systems. $SOURCE attempted to read one or more files or directories from a mounted filesystem of this type. As NFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured $SOURCE to read files from a NFS filesystem this access attempt could signal an intrusion attempt.
gu: SELinux એ NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી $SOURCE ને બચાવેલ છે. NFS (Network Filesystem) એ Unix / Linux સિસ્ટમો પર સામાન્ય રીતે વાપરવામાં આવતી નેટવર્ક ફાઈલસિસ્ટમ છે. $SOURCE એ આ પ્રકારની માઉન્ટ થયેલ એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓમાંથી વાંચવાથી બચાવેલ છે. NFS ફાઈલસિસ્ટમો સારું SELinux લેબલીંગને આધાર આપતું નથી, ફાઈલસિસ્ટમમાંની બધી ફાઈલો અને ડિરેક્ટરીઓને એક જ સુરક્ષા સંદર્ભ હશે. જો તમે $SOURCE ને NFS ફાઈલસિસ્ટમમાંથી આ વપરાશ પૂરો પાડવા માટે રૂપરેખાંકિત કરેલ નહિં હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: SELinux prevented $SOURCE from $ACCESS files stored on a Windows SMB/CIFS (Samba) filesytem.
gu: SELinux એ Windows SMB/CIFS (Samba) ફાઈલ સિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી $SOURCE ને બચાવેલ છે.

source: SELinux prevented $SOURCE from $ACCESS files stored on a Windows SMB/CIFS (Samba) filesystem. CIFS is a network filesystem commonly used on Windows systems. $SOURCE attempted to read one or more files or directories from a mounted filesystem of this type. As CIFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured $SOURCE to read files from a CIFS filesystem this access attempt could signal an intrusion attempt.
gu: SELinux એ Windows SMB/CIFS (Samba) ફાઈલ સિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી $SOURCE ને બચાવેલ છે. CIFS એ Windows સિસ્ટમો પર સામાન્ય રીતે વાપરવામાં આવતી નેટવર્ક ફાઈલસિસ્ટમ છે. $SOURCE એ આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમમાંથી એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓ વાંચવાનું પસંદ કરેલ છે. CIFS ફાઈલસિસ્ટમો સારું SELinux લેબલીંગને આધાર આપતી નહિં હોવાના કારણે, ફાઈલસિસ્ટમમાં સંગ્રહાયેલ બધી ફાઈલો અને ડિરેક્ટરીઓને એકસરખો સુરક્ષા સંદર્ભ હશે. જો તમે $SOURCE ને CIFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે રૂપરેખાંકિત કરેલ નહિં હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: SELinux is preventing the users from running TCP servers in the usedomain.
gu: SELinux એ વપરાશકર્તાઓને usedomain માં TCP સર્વરો ચલાવવાથી અટકાવી રહ્યું છે.

source: SELinux has denied the $SOURCE program from binding to a network port $PORT_NUMBER which does not have an SELinux type associated with it. $SOURCE does not have an SELinux policy defined for it when run by the user, so it runs in the users domain. SELinux is currently setup to deny TCP server to run within the user domain. If you did not expect programs like $SOURCE to bind to a network port, then this could signal a intrusion attempt. If this system is running as an NIS Client, turning on the allow_ypbind boolean, may fix the problem. setsebool -P allow_ypbind=1.
gu: SELinux એ $SOURCE કાર્યક્રમને નેટવર્ક પોર્ટ $PORT_NUMBER સાથે બાંધવાથી નામંજૂર કર્યો કે જેને તેની સાથે SELinux પ્રકાર સંકળાયેલ નથી. $SOURCE માટે SELinux પોલિસી તેના માટે વ્યાખ્યાયિત નથી કે જ્યારે તે વપરાશકર્તા દ્વારા ચલાવવામાં આવે, તેથી તે વપરાશકર્તાઓ ડોમેઈનમાં ચાલે છે. SELinux એ વર્તમાનમાં TCP સર્વરને વપરાશકર્તા ડોમેઈનમાં ચલાવવા નામંજૂર કરવા માટે સુયોજિત થયેલ છે. જો તમને $SOURCE જેવા કાર્યક્રમોને નેટવર્ક પોર્ટ સાથે બાંધવાની ઈચ્છા નહિં હોય, તો પછી આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત. જો આ સિસ્ટમ NIS ક્લાઈન્ટ તરીકે ચાલી રહી હોય, તો allow_ypbind બુલિયન ચાલુ કરવાનું, સમસ્યા ઉકેલી શકશે. setsebool -P allow_ypbind=1.

source: If you want to allow user programs to run as TCP Servers, you can turn on the user_tcp_server boolean, by executing: setsebool -P $BOOLEAN=1
gu: જો તમે વપરાશકર્તા કાર્યક્રમોને TCP સર્વરો તરીકે ચલાવવા માટે પરવાનગી આપવા માંગો, તો તમે user_tcp_server બુલિયનને, ચલાવીને ચાલુ કરી શકો છો: setsebool -P $BOOLEAN=1

source: SELinux is preventing xen ($SOURCE) "$ACCESS" to $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ xen ($SOURCE) "$ACCESS" ને $TARGET_PATH ($TARGET_TYPE) થી બચાવી રહ્યું છે.

source: SELinux denied xen access to $TARGET_PATH. If this is a XEN image, it has to have a file context label of xen_image_t. The system is setup to label image files in directory./var/lib/xen/images correctly. We recommend that you copy your image file to /var/lib/xen/images. If you really want to have your xen image files in the current directory, you can relabel $TARGET_PATH to be xen_image_t using chcon. You also need to execute semanage fcontext -a -t xen_image_t '$TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a xen image it could indicate either a bug or an intrusion attempt.
gu: SELinux એ $TARGET_PATH માટે xen વપરાશ નામંજૂર કર્યો. જો આ XEN ઈમેજ હોય તો તેને xen_image_t નો ફાઈલ સંદર્ભ લેબલ ખસેડવું પડશે. સિસ્ટમ ઈમેજ ફાઈલોને /var/lib/xen/image માં યોગ્ય રીતે લેબલ કરવા માટે સુયોજિત થયેલ છે. અમે આગ્રહ રાખીએ છીએ કે તમે તમારી ઈમેજ ફાઈલને આ ડિરેક્ટરીમાં નકલ કરો. જો તમે ખરેખર તમારી xen ઈમેજ ફાઈલોને આ ડિરેક્ટરીમાં રાખવા માંગો, તો તમે $TARGET_PATH ને chcon ની મદદથી xen_image_t ફાઈલ/ડિરેક્ટરી બનાવવા માટે પુનઃલેબલ કરી શકો. જો તમે આવું કરો તો તમારે આ નવા પાથને સિસ્ટમ મૂળભૂતોમાં ઉમેરવા માટે semanage fcontext -a -t xen_image_t '$TATGET_PATH' પણ ચલાવવો પડશે. જો તમારો $TARGET_PATH ને xen ઈમેજ તરીકે વાપરવાતો હેતુ નહિં હોય તો તે ક્યાં તો ભૂલ સૂચવી શક્યું હોત અથવા તે ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: You can alter the file context by executing chcon -t xen_image_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t xen_image_t '$TARGET_PATH'"
gu: તમે chcon -t xen_image_t '$TARGET_PATH' ચલાવીને ફાઈલ સંદર્ભ બદલી શકો છો તમારે સિસ્ટમ પર મૂળભૂત ફાઈલ સંદર્ભ ફાઈલો બદલવો જ પડશે તેમને પૂરા પુનઃલેબલ જાળવવા માટે. "semanage fcontext -a -t xen_image_t '$TARGET_PATH'"

source: %s: cannot open /etc/sysconfig/network: %s
uk_ua: %s: неможливо в╕дкрити /etc/sysconfig/network: %s

source: %s: cannot open /etc/yp.conf: %s
uk_ua: %s: неможливо в╕дкрити /etc/yp.conf: %s

source: NIS Server:
uk_ua: NIS сервер:

source: Request via broadcast
uk_ua: Запит до вс╕х

source: Enable NIS
uk_ua: Дозволити NIS

source: NIS Domain:
uk_ua: Домен NIS:

source: Use Shadow Passwords
uk_ua: Використати прихован╕ парол╕

source: Enable MD5 Passwords
uk_ua: Дозволити парол╕ MD5

source: Ok
uk_ua: Так

source: Back
uk_ua: Назад

source: Cancel
uk_ua: Скасувати

source: (NIS not installed)
uk_ua: (NIS не встановлено)

source: or use:
uk_ua: або використайте:

source: Authentication Configuration
uk_ua: Конф╕гурац╕я ототожнення

source: Error
uk_ua: Помилка

source: You must enter a NIS server or request via broadcast.
uk_ua: Ви ма╓те вказати сервер NIS або запит до вс╕х.

source: You must enter a NIS domain.
uk_ua: Ви ма╓те вказати домен NIS.

source: %s: cannot open /etc/sysconfig/network- for writing: %s
uk_ua: %s: неможливо в╕дкрити /etc/sysconfig/network- для запису: %s

source: %s: cannot open /etc/yp.conf- for writing: %s
uk_ua: %s: не можливо в╕дкрити /etc/yp.conf- для запису: %s

source: %s: error opening %s
uk_ua: %s: помилка в╕дкриття %s

source: %s: bad argument %s: %s
uk_ua: %s: нев╕рний аргумент %s: %s

source: %s: unexpected argument
uk_ua: %s: неспод╕ваний аргумент

source: %s: can only be run as root
uk_ua: %s: приступно лише користувачев╕ root

source: %s: critical error reading /etc/sysconfig/network
uk_ua: %s: критична помилка читання /etc/sysconfig/network

source: %s: critical error reading /etc/yp.conf
uk_ua: %s: критична помилка читання /etc/yp.conf

source: %s: critical error reading /etc/pam.d/passwd
uk_ua: %s: критична помилка читання /etc/pam.d/passwd

source: <Tab>/<Alt-Tab> between elements | <Space> selects | <F12> next screen
uk_ua: <Tab>/<Alt-Tab> м╕ж елементами | <Space> виб╕р | <F12> наступний екран

source: %s: nis domain was set to %s, but dialog was cancelled
uk_ua: %s: домен nis було всановлено %s, але д╕ало╜ скасовано

source: return values: nis: %c, nisdomain: %s, shadow: %c, md5: %c
uk_ua: повернен╕ значення: nis: %c, домен nis: %s, shadow: %c, md5: %c

source: %s: critical error writing /etc/sysconfig/network
uk_ua: %s: критична помилка запису /etc/sysconfig/network

source: %s: critical error writing /etc/yp.conf
uk_ua: %s: критична помилка запису /etc/yp.conf

source: %s: critical error turning on NIS service
uk_ua: %s: критична помилка ув╕мкнення служби NIS

source: %s: critical error with shadow password manipulation
uk_ua: %s: критична помилка опрацювання пароля
