Repository: pbrezina/my-scripts
Catalog: po/*.po
Languages: gu, uk_ua

source: SELinux prevented the CVS application from reading the shadow password file.
gu: SELinux એ CVS કાર્યક્રમને shadow પાસવર્ડ ફાઈલ વાંચવાથી બચાવી છે.

source: SELinux prevented the CVS application from reading the shadow password file. The CVS application requires this access when it is configured for direct connection (i.e., pserver) and to authenticate to the system password / shadow files without PAM. It is possible that this access request signals an intrusion attempt. It is recommended that CVS be configured to use PAM, authenticate to a separate user file, or use another protocol (e.g., ssh) instead of allowing this access. See the CVS manual for more details on why this access is potentially insecure (<a href="http://ximbiot.com/cvs/manual/cvs-1.11.22/cvs_2.html">http://ximbiot.com/cvs/manual/cvs-1.11.22/cvs_2.html</a>).
gu: SELinux એ CVS કાર્યક્રમને shadow પાસવર્ડ ફાઈલ વાંચવાથી બચાવી છે. CVS કાર્યક્રમને આ વપરાશ જરૂરી છે જ્યારે તે સીધા જોડાણ માટે રૂપરેખાંકિત થયેલ હોય (એટલે કે, pserver) અને PAM વિના સિસ્ટમ પાસવર્ડ / shadow ફાઈલો સાથે સત્તાધિકરણ કરવા માટે. એ શક્ય છે કે આ વપરાશ અરજી સંકેતો ઘૂંસણખોરી લેવાની અરજી કરે. એ આગ્રહણીય છે કે CVS એ PAM વાપરવા માટે, અલગ વપરાશકર્તા ફાઈલમાં સત્તાધિકારીત કરવા માટે, અથવા આ વપરાશની પરવાનગી આપ્યા વિના અન્ય પ્રોટોકોલ (દા.ત., ssh) માટે આગ્રહણીય છે. આ વપરાશ કેવી રીતે અસંભવિત રીતે અસુરક્ષિત કેમ છે તેના પર વધુ વિગતો માટે CVS માર્ગદર્શિકા જુઓ (<a href="http://ximbiot.com/cvs/manual/cvs-1.11.22/cvs_2.html">http://ximbiot.com/cvs/manual/cvs-1.11.22/cvs_2.html</a>).

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1"
gu: "$BOOLEAN" બુલિયનને ખરુમાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P $BOOLEAN=1"

source: SELinux prevented $SOURCE from writing $TARGET_PATH.
gu: SELinux એ $SOURCE ને $TARGET_PATH લખવાથી અટકાવ્યું છે.

source: SELinux prevented $SOURCE from writing $TARGET_PATH. If $TARGET_PATH is a core file, you may want to allow this. If $TARGET_PATH is not a core file, this could signal a intrusion attempt.
gu: SELinux એ $SOURCE ને $TARGET_PATH લખવાથી અટકાવ્યું છે. જો $TARGET_PATH એ મૂળ ફાઈલ હોય, તો તમે આને પરવાનગી આપવા માંગશો. જો $TARGET_PATH એ મૂળ ફાઈલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1."
gu: "$BOOLEAN" બુલિયન કિંમતને ખરામાં બદલવાનું આ વપરાશને માન્ય કરશે: "setsebool -P $BOOLEAN=1."

source: SELinux prevented $SOURCE from using the terminal $TARGET_PATH.
gu: SELinux એ $SOURCE ને ટર્મિનલ $TARGET_PATH વાપરવાથી અટકાવ્યું છે.

source: SELinux prevented $SOURCE from using the terminal $TARGET_PATH. In most cases daemons do not need to interact with the terminal, usually these avc messages can be ignored. All of the confined daemons should have dontaudit rules around using the terminal. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this selinux-policy. If you would like to allow all daemons to interact with the terminal, you can turn on the $BOOLEAN boolean.
gu: SELinux એ $SOURCE ને ટર્મિનલ $TARGET_PATH વાપરવાથી અટકાવ્યું છે. મોટા ભાગના કિસ્સાઓમાં ડિમનોને ટર્મિનલ સાથે સંપર્ક કરવાની જરૂર નથી, સામાન્ય રીતે આ avc સંદેશાઓ અવગણી શકાય છે. બધા શુદ્ધ થયેલ ડિમનોને ટર્મિનલ ફરતે dontaudit નિયમો હોવા જોઈએ. મહેરબાની કરીને selinux-policy વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો. જો તમે બધા ડિમનોને ટર્મિનલ સાથે સંપર્ક કરવા માટે પરવાનગી આપવા માંગો, તો તમે $BOOLEAN બુલિયન ચાલુ કરી શકો.

source: SELinux is preventing $SOURCE from changing the access protection of memory on the heap.
gu: SELinux એ $SOURCE ને હીપ પરથી મેમરીના વપરાશની સુરક્ષામાંથી અટકાવી રહ્યું છે.

source: The $SOURCE application attempted to change the access protection of memory on the heap (e.g., allocated using malloc). This is a potential security problem. Applications should not be doing this. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this package.
gu: $SOURCE કાર્યક્રમ એ હીપ (દા.ત. malloc દ્વારા ફાળવવામાં આવેલ) પર મેમરીની વપરાશ સુરક્ષા બદલવા માટે ચાલુ કરાયેલ છે. આ સંભવિત સુરક્ષા સમસ્યા છે. કાર્યક્રમોએ આ કરવું જોઈએ નહિં. કાર્યક્રમો અમુક સમયે અયોગ્ય રીતે કોડ કરાયેલ હોય છે અને આ પરવાનગીની અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું સમજાવે છે કે કેવી રીતે આ જરૂરીયાત દૂર કરવી. જો $SOURCE કામ નહિં કરે અને તમારે તેને કામ કરવાની જરૂર હોય, તો તમે SELinux ને કામચલાઉ રીતે આ વપરાશની પરવાનગી આપી શકો છો જ્યાં સુધી કાર્યક્રમ સુધારાઈ નહિં જાય. મહેરબાની કરીને આ આ પેકેજ વિરુદ્ધિ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi"> ભૂલનો અહેવાલ</a> જમા કરો.

source: If you want $SOURCE to continue, you must turn on the $BOOLEAN boolean. Note: This boolean will affect all applications on the system.
gu: જો તમે $SOURCE ને ચાલુ રાખવા માંગો, તો તમારે $BOOLEAN બુલિયન ચાલુ કરવું જ જોઈએ. નોંધ: આ બુલિયન સિસ્ટમ પરના બધા કાર્યક્રમોને અસર કરશે.

source: Memory
gu: મેમરી

source: SELinux is preventing $SOURCE from changing a writable memory segment executable.
gu: SELinux એ $SOURCE ને લખી શકાય તેવા મેમરી સેગ્મેન્ટ એક્ઝેક્યુટેબલમાંથી બદલવાથી બચાવી રહ્યું છે.

source: The $SOURCE application attempted to change the access protection of memory (e.g., allocated using malloc). This is a potential security problem. Applications should not be doing this. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this package.
gu: $SOURCE કાર્યક્રમ એ હીપ (દા.ત. malloc દ્વારા ફાળવવામાં આવેલ) પર મેમરીની વપરાશ સુરક્ષા બદલવા માટે ચાલુ કરાયેલ છે. આ સંભવિત સુરક્ષા સમસ્યા છે. કાર્યક્રમોએ આ કરવું જોઈએ નહિં. કાર્યક્રમો અમુક સમયે અયોગ્ય રીતે કોડ કરાયેલ હોય છે અને આ પરવાનગીની અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું સમજાવે છે કે કેવી રીતે આ જરૂરીયાત દૂર કરવી. જો $SOURCE કામ નહિં કરે અને તમારે તેને કામ કરવાની જરૂર હોય, તો તમે SELinux ને કામચલાઉ રીતે આ વપરાશની પરવાનગી આપી શકો છો જ્યાં સુધી કાર્યક્રમ સુધારાઈ નહિં જાય. મહેરબાની કરીને આ આ પેકેજ વિરુદ્ધિ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi"> ભૂલનો અહેવાલ</a> જમા કરો.

source: If you trust $SOURCE to run correctly, you can change the context of the executable to unconfined_execmem_exec_t. "chcon -t unconfined_execmem_exec_t '$SOURCE_PATH'". You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t unconfined_execmem_exec_t '$SOURCE_PATH'"
gu: જો તમને $SOURCE_PATH ને યોગ્ય રીતે ચલાવવાનો વિશ્વાસ હોય, તો તમે એક્ઝેક્યુટેબલનો સંદર્ભ unconfined_execmem_exec_t માં બદલી શકો છો. "chcon -t unconfined_execmem_exec_t $SOURCE_PATH".

source: SELinux is preventing $SOURCE from loading $TARGET_PATH which requires text relocation.
gu: SELinux એ $SOURCE ને $TARGET_PATH લાવવાથી બચાવી રહ્યું છે કે જેને લખાણ પુનઃસ્થાનીકરણ જરૂરી છે.

source: The $SOURCE application attempted to load $TARGET_PATH which requires text relocation. This is a potential security problem. Most libraries do not need this permission. Libraries are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. You can configure SELinux temporarily to allow $TARGET_PATH to use relocation as a workaround, until the library is fixed. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this package.
gu: $SOURCE કાર્યક્રમ એ $TARGET_PATH લોડ કરવા જઈ રહ્યું છે કે જેને લખાણ પુનઃસ્થાનિકરણ જરૂરી છે. આ સંભવિત સુરક્ષા સમસ્યા છે. મોટા ભાગની લાઈબ્રેરીઓને આ પરવાનગીની જરૂર નથી. લાઈબ્રેરીઓ અમુકવાર અયોગ્ય રીતે કોડ થયેલ હોય છે અને આ પરવાનગી માટે અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું કેવી રીતે આ જરૂરીયાત દૂર કરવી તે સમજાવે છે. તમે $TARGET_PATH ને કામ કરવા માટે પુનઃસ્થાનિકરણ વાપરવા માટે પરવાનગી આપવા માટે SELinux ને કામચલાઉ રીતે રૂપરેખાંકિત કરી શકો છો, જ્યાં સુધી લાઈબ્રેરી ચોક્કસ નહિં થાય. મહેરબાની કરીને આ પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો.

source: If you trust $TARGET_PATH to run correctly, you can change the file context to textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t textrel_shlib_t '$TARGET_PATH'"
gu: જો તમને $TARGET_PATH ને ચલાવવાનો વિશ્વાસ હોય, તો તમે ફાઈલ સંદર્ભને textrel_shlib_t માં બદલી શકો છો. "chcon -t textrel_shlib_t $TARGET_PATH" તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને સિસ્ટમ પર બદલવી જ પડશે તેમને પૂરા પુનઃલેબલમાં સાચવવા માટે. "semanage fcontext -a -t textrel_shlib_t '$TARGET_PATH'"

source: SELinux is preventing $SOURCE from making the program stack executable.
gu: SELinux એ $SOURCE ને કાર્યક્રમ સ્ટેક એક્ઝેક્યુટેબલ બનાવવાથી બચાવી રહ્યું છે.

source: The $SOURCE application attempted to make its stack executable. This is a potential security problem. This should never ever be necessary. Stack memory is not executable on most OSes these days and this will not change. Executable stack memory is one of the biggest security problems. An execstack error might in fact be most likely raised by malicious code. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this package.
gu: $SOURCE કાર્યક્રમે તેનો સ્ટેક એક્ઝેક્યુટેબલ બનાવવાનું પસંદ કરેલ છે. આ સંભવિત સુરક્ષા સમસ્યા છે. આ ક્યારેય હંમેશ માટે જરૂરી હોવું જોઈએ નહિં. સ્ટેક મેમરી મોટા ભાગની OS પર આ દિવસોમાં એક્ઝેક્યુટેબલ નથી અને આ બદલાશે નહિં. એક્ઝેક્યુટેબલ સ્ટેક મેમરી એ સુરક્ષા સમસ્યાઓમાંનો મોટામાં મોટો છે. execstack ભૂલ કદાચ વાસ્તવમાં મોટે ભાગે મલીન કોડ દ્વારા પેદા કરાયેલ છે. કાર્યક્રમો અમુક સમયે અયોગ્ય રીતે કોડ થયેલ હોય છે અને આ પરવાનગીની અરજી કરે છે. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> વેબ પાનું કેવી રીતે જરૂરીયાત દૂર કરવી તે સૂચવે છે. જો $SOURCE કામ નહિં કરે અને તમારે તેને કામ કરવાની જરૂર હોય, તો તમે SELinux ને કામચલાઉ રીતે આ વપરાશની પરવાનગી આપવા માટે રૂપરેખાંકિત કરી શકો છો જ્યાં સુધી કાર્યક્રમ ચોક્કસ નહિં થઈ જાય. મહેરબાની કરીને આ આ પેકેજ વિરુદ્ધિ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi"> ભૂલનો અહેવાલ</a> જમા કરો.

source: Sometimes a library is accidentally marked with the execstack flag, if you find a library with this flag you can clear it with the execstack -c LIBRARY_PATH. Then retry your application. If the app continues to not work, you can turn the flag back on with execstack -s LIBRARY_PATH. Otherwise, if you trust $SOURCE to run correctly, you can change the context of the executable to unconfined_execmem_exec_t. "chcon -t unconfined_execmem_exec_t '$SOURCE_PATH'" You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t unconfined_execmem_exec_t '$SOURCE_PATH'"
gu: અમુક વાર લાઈબ્રેરી આકસ્મિક રીતે execstack ફ્લેગ સાથે ચિહ્નિત થાય છે, જો તમને આ ફ્લેગ સાથે લાઈબ્રેરી મળે તો તમે તેને execstack -c LIBRARY_PATH સાથે સાફ કરી શકો છો. પછી તમારા કાર્યક્રમનો પુનઃપ્રયાસ કરો. જો કાર્યક્રમ નહિં કામ કરવાનું ચાલુ રાખે, તો તમે ફ્લેગને ફરીથી execstack -s LIBRARY_PATH વડે ચાલુ કરી શકો છો. નહિંતર, જો તમે $SOURCE નો યોગ્ય રીતે ચલાવવામાં વિશ્વાસ કરો, તો તમે એક્ઝેક્યુટેબલનો સંદર્ભ unconfined_execmem_exec_t. "chcon -t unconfined_execmem_exec_t '$SOURCE_PATH'" માં બદલી શકો છો તમારે સિસ્ટમ પર મૂળભૂત ફાઈલ સંદર્ભ ફાઈલો પણ તેમને સંપૂર્ણ પુનઃલેબલ પર જાળવી રાખવા માટે બદલવી જ પડશે. "semanage fcontext -a -t unconfined_execmem_exec_t '$SOURCE_PATH'"

source: SELinux policy is preventing the ftp daemon from writing to a public directory.
gu: SELinux પોલિસી એ ftp ડિમનને જાહેર ડિરેક્ટરીમાં લખવાથી બચાવી રહ્યું છે.

source: SELinux policy is preventing the ftp daemon from writing to a public directory. If ftpd is not setup to allow anonymous writes, this could signal a intrusion attempt.
gu: SELinux પોલિસી એ ftp ડિમનને જાહેર ડિરેક્ટરીમાંથી લખવાથી બચાવી રહી છે. જો ftpd એ અનામિક લેખનોને સુયોજિત કરવા માટે માન્ય નહિં હોય, તો આ ઘૂંસણખોરીનો સંકેત આપી શક્યું હશે.

source: If the ftp daemon should be allowed to write to this directory you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the ftpd_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"
gu: જો ftp ડિમન આ ડિરેક્ટરીમાં લખવા માટે માન્ય હોવી જોઈએ તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની અને public_content_rw_t જાહેર ડિરેક્ટરીનો સંદર્ભ બદલવાની જરૂર છે. આગળની જાણકારી માટે ftpd_selinux મદદ પાનું વાંચો: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"

source: SELinux is preventing the ftp daemon from writing files outside the home directory ($TARGET_PATH).
gu: SELinux એ ftp ડિમનને ઘર ડિરેક્ટરી ($TARGET_PATH) ની બહાર ફાઈલો લખવાથી બચાવી રહ્યું છે.

source: SELinux has denied the ftp daemon write access to directories outside the home directory ($TARGET_PATH). Someone has logged in via your ftp daemon and is trying to create or write a file. If you only setup ftp to allow anonymous ftp, this could signal a intrusion attempt.
gu: SELinux એ ftp ડિમનને ઘર ડિરેક્ટરી ($TARGET_PATH) બહારની ડિરેક્ટરીઓને લખવાના વપરાશની નામંજૂરી કરી છે. કોઈકે તમારા ftp ડિમન તરીકે પ્રવેશ કરેલ છે અને ફાઈલ બનાવવાનો અથવા લખવાનો પ્રયાસ કરી રહ્યો છે. જો તમે જ ftp ને અનામિક ftp ને પરવાનગી આપવા માટે સુયોજિત કરેલ હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત કરી શક્યું હોત.

source: If you do not want SELinux preventing ftp from writing files anywhere on the system you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે SELinux વડે ftp ને સિસ્ટમ પર ગમે ત્યાં ફાઈલો લખવાથી બચાવવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesytem.
gu: SELinux એ ftp ડિમનને $ACCESS ફાઈલો કે જે CIFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ છે તેનાથી બચાવેલ છે.

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesystem. CIFS (Comment Internet File System) is a network filesystem similar to SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As CIFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a CIFS filesystem this access attempt could signal an intrusion attempt.
gu: SELinux એ ftp ડિમનને CIFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી બચાવેલ છે. CIFS (Comment Internet File System) એ SMB જેવી જ નેટવર્ક ફાઈલસિસ્ટમ છે (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) ftp ડિમને આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમની એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓમાંથી વાંચવાનું પસંદ કરેલ છે. CIFS ફાઈલસિસ્ટમો fine-grained SELinux લેબલીંગને આધાર આપતું નહિં હોવાથી, ફાઈલસિસ્ટમમાંની બધી ફાઈલો અને ડિરેક્ટરીઓને એવો જ સુરક્ષા સંદર્ભ હોવો જોઈએ. CIFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે જો તમે ftp ડિમનને રૂપરેખાંકિત કરેલ નહિં હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હશે.

source: Changing the "$BOOLEAN" and "$WRITE_BOOLEAN" booleans to true will allow this access: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". warning: setting the "$WRITE_BOOLEAN" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on CIFS filesystems.
gu: "$BOOLEAN" અને "$WRITE_BOOLEAN" બુલિયનોને ખરામાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". ચેતવણી: "$WRITE_BOOLEAN" બુલિયનને ખરામાં સુયોજિત કરવાનું ftp ડિમનને બધા જાહેર સમાવિષ્ટો (public_content_t પ્રકાર સાથેની ફાઈલો અને ડિરેક્ટરીઓ) માં લખવાની પરવાનગી આપશે CIFS ફાઈલસિસ્ટમો પર ફાઈલો અને ડિરેક્ટરીઓ પર લખવા સાથે વધુમાં.

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesytem.
gu: SELinux એ ftp ડિમનને $ACCESS ફાઈલોથી બચાવેલ છે કે જેઓ NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ છે.

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesystem. NFS (Network Filesystem) is a network filesystem commonly used on Unix / Linux systems. The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As NFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a NFS filesystem this access attempt could signal an intrusion attempt.
gu: SELinux એ ftp ડિમનને NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોમાંથી લખવાથી બચાવેલ છે. NFS (Network Filesystem) એ Unix / Linux સિસ્ટમો પર સામાન્ય રીતે વાપરવામાં આવતી નેટવર્ક ફાઈલસિસ્ટમ છે. ftp ડિમને આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમમાંથી એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓ વાંચવાનું પસંદ કરેલ છે. NFS ફાઈલસિસ્ટમો fine-grained SELinux લેબલીંગને આધાર આપતું નહિં હોવાથી, ફાઈલસિસ્ટમમાંની બધી ફાઈલો અને ડિરેક્ટરીઓને સરખો સુરક્ષા સંદર્ભ હશે. જો તમે ftp ડિમનને NFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે રૂપરેખાંકિત નહિં કરેલ હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: Changing the "allow_ftpd_use_nfs" boolean to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1."
gu: "allow_ftpd_use_nfs" બુલિયન કિંમતને ખરામાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P allow_ftpd_use_nfs=1."

source: Changing the "allow_ftpd_use_nfs" and "$WRITE_BOOLEAN" booleans to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". warning: setting the "$WRITE_BOOLEAN" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on NFS filesystems.
gu: "allow_ftpd_use_nfs" અને "$WRITE_BOOLEAN" બુલિયનોને ખરામાં બદલવાનું આ વપરાશની પરવાનગી આપશે: "setsebool -P allow_ftpd_use_nfs=1 $WRITE_BOOLEAN=1". ચેતવણી: "$WRITE_BOOLEAN" બુલિયનને ખરામાં સુયોજિત કરવાનું ftp ડિમનને બધા જાહેર સમાવિષ્ટો (public_content_t પ્રકાર સાથેની ફાઈલો અને ડિરેક્ટરીઓ) માં લખવાની પરવાનગી આપશે NFS ફાઈલસિસ્ટમો પર ફાઈલો અને ડિરેક્ટરીઓ પર લખવા સાથે વધુમાં.

source: SELinux prevented the gss daemon from reading unprivileged user temporary files.
gu: SELinux એ gss ડિમનને બિનવિશેષાધિકારી વપરાશકર્તા કામચલાઉ ફાઈલો વાંચવાથી બચાવેલ છે.

source: SELinux prevented the gss daemon from reading unprivileged user temporary files (e.g., files in /tmp). Allowing this access is low risk, but if you have not configured the gss daemon to read these files this access request could signal an intrusion attempt.
gu: SELinux એ gss ડિમનને બિનવિશેષાધિકારી વપરાશકર્તા કામચલાઉ ફાઈલો વાંચવાથી બચાવેલ છે (દા.ત., /tmp માંની ફાઈલો). આ વપરાશને પરવાનગી આપવાનું ઓછું જોખમી છે, પરંતુ જો તમે gss ડિમનને આ ફાઈલો વાંચવા માટે રૂપરેખાંકિત કરેલ નહિં હોય તો આ વપરાશ અરજી ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: Authorization
gu: સત્તાધિકરણ

source: SELinux policy is preventing the http daemon from writing to a public directory.
gu: SELinux પોલિસી એ http ડિમનને જાહેર ડિરેક્ટરી લખવાથી બચાવી રહ્યું છે.

source: SELinux policy is preventing the http daemon from writing to a public directory. If httpd is not setup to write to public directories, this could signal a intrusion attempt.
gu: SELinux પોલિસી એ http ડિમનને જાહેર ડિરેક્ટરી લખવાથી બચાવી રહ્યું છે. જો http એ જાહેર ડિરેક્ટરીઓ લખવા માટે સુયોજિત થયેલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If httpd should be allowed to write to this directory you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the httpd_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"
gu: જો http આ ડિરેક્ટરીમાં લખવા માટે માન્ય હોવું જોઈએ તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની અને જાહેર ડિરેક્ટરીનો ફાઈલ સંદર્ભ public_content_rw_t માં બદલવાની જરૂર છે. વધુ જાણકારી માટે httpd_selinux મદદ પાનું વાંચો: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"

source: Web Server
gu: વેબ સર્વર

source: SELinux policy is preventing an httpd script from writing to a public directory.
gu: SELinux પોલિસી એ httpd સ્ક્રિપ્ટને જાહેર ડિરેક્ટરીમાં લખવાથી બચાવી રહી છે.

source: SELinux policy is preventing an httpd script from writing to a public directory. If httpd is not setup to write to public directories, this could signal a intrusion attempt.
gu: SELinux પોલિસી એ httpd સ્ક્રિપ્ટને જાહેર ડિરેક્ટરીમાં લખવાથી બચાવી રહી છે. જો httpd એ જાહેર ડિરેક્ટરીઓ લખવા માટે સુયોજિત થયેલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If httpd scripts should be allowed to write to public directories you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the httpd_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"
gu: જો httpd સ્ક્રિપ્ટો જાહેર ડિરેક્ટરીઓમાં લખવા માટે માન્ય હોવી જોઈએ તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની અને જાહેર ડિરેક્ટરીનો ફાઈલ સંદર્ભ public_content_rw_t માં બદલવાની જરૂર છે. આગળની જાણકારી માટે httpd_selinux મદદ પાનું વાંચો: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"

source: SELinux prevented a java plugin ($SOURCE_TYPE) from making the stack executable.
gu: SELinux એ java પ્લગઈનને ($SOURCE_TYPE) સ્ટેક ચલાવી શકાય તેવું બનાવવાથી બચાવ્યું છે.

source: SELinux prevented the java plugin ($SOURCE_TYPE) from making the stack executable. An executable stack should not be required by any software (see <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> for more information). However, some versions of the Java plugin are known to require this access to work properly. You should check for updates to the software before allowing this access.
gu: SELinux એ java પ્લગઈનને ($SOURCE_TYPE) સ્ટેક એક્ઝેક્યુટેબલ બનાવવાથી બચાવેલ છે. એક્ઝેક્યુટેબલ સ્ટેક કોઈપણ સોફ્ટવેર દ્વારા જરૂરી હોવું જોઈએ નહિં (વધુ જાણકારી માટે <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> જુઓ). છતાં, Java પ્લગઈનની અમુક આવૃત્તિઓ આ વપરાશ પર યોગ્ય રીતે કામ કરવા માટે જાણીતી છે. આ વપરાશની પરવાનગી આપવા પહેલાં તમારે સોફ્ટવેર માટેના સુધારાઓની ચકાસણી કરવી જોઈએ.

source: SELinux prevented $SOURCE from using kerberos.
gu: SELinux એ $SOURCE ને કર્બરોઝ વાપરવાથી બચાવ્યું છે.
