Repository: pbrezina/my-scripts
Catalog: po/*.po
Languages: gu, uk_ua

source: SELinux has denied the $SOURCE ($SOURCE_TYPE) "$ACCESS" access to device $TARGET_PATH. $TARGET_PATH is mislabeled, this device has the default label of the /dev directory, which should not happen. All Character and/or Block Devices should have a label. You can attempt to change the label of the file using restorecon -v '$TARGET_PATH'. If this device remains labeled device_t, then this is a bug in SELinux policy. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against the selinux-policy package. If you look at the other similar devices labels, ls -lZ /dev/SIMILAR, and find a type that would work for $TARGET_PATH, you can use chcon -t SIMILAR_TYPE '$TARGET_PATH', If this fixes the problem, you can make this permanent by executing semanage fcontext -a -t SIMILAR_TYPE '$TARGET_PATH' If the restorecon changes the context, this indicates that the application that created the device, created it without using SELinux APIs. If you can figure out which application created the device, please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this application.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) "$ACCESS" વપરાશ ઉપકરણ $TARGET_PATH માટે નામંજૂર કર્યો છે. $TARGET_PATH ને ખોટું લેબલ અપાયેલ છે, આ ઉપકરણને /dev ડિરેક્ટરીનું મૂળભૂત લેબલ છે, કે જે થવું જોઈએ નહિં. બધા અક્ષર અને/અથવા બ્લોક ઉપકરણોને લેબલ હોવું જોઈએ. તમે ફાઈલનું લેબલ આની મદદથી બદલી શકો છો restorecon -v '$TARGET_PATH'. જો આ ઉપકરણ device_t લેબલવાળું રહે, તો પછી આ SELinux પોલિસીમાં ભૂલ છે. મહેરબાની કરીને selinux-policy પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો. જો તમે અન્ય સરખા ઉપકરણોના લેબલો માટે જુઓ, ls -lZ /dev/SIMILAR, અને પ્રકાર મેળવો કે જે $TARGET_PATH માટે કામ કરે, તો તમે chcon -t SIMILAR_TYPE '$TARGET_PATH' વાપરી શકો, જો આ સમસ્યાને સુધારે, તમે આને નીચેનો આદેશ ચલાવીને કાયમી બનાવી શકો છો semanage fcontext -a -t SIMILAR_TYPE '$TARGET_PATH' જો restorecon સંદર્ભ બદલે, તો આ સૂચવે છે કે કાર્યક્રમ કે જેણે ઉપકરણ બનાવ્યું, તેણે તેને SELinux API વિના બનાવ્યું. જો તમે શોધી શકો કે કયા કાર્યક્રમોએ ઉપકરણ બનાવ્યું, તો મહેરબાની કરીને આ કાર્યક્રમ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો.

source: Attempt restorecon -v '$TARGET_PATH' or chcon -t SIMILAR_TYPE '$TARGET_PATH'
gu: restorecon -v '$TARGET_PATH' અથવા chcon -t SIMILAR_TYPE '$TARGET_PATH' ચલાવો

source: SELinux is preventing the $SOURCE ($SOURCE_TYPE) from executing $TARGET_PATH.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) ને પોર્ટ $PORT_NUMBER સાથે જોડાવાથી બચાવી રહ્યું છે.

source: SELinux has denied the $SOURCE from executing $TARGET_PATH. If $SOURCE is supposed to be able to execute $TARGET_PATH, this could be a labeling problem. Most confined domains are allowed to execute files labeled bin_t. So you could change the labeling on this file to bin_t and retry the application. If this $SOURCE is not supposed to execute $TARGET_PATH, this could signal a intrusion attempt.
gu: SELinux એ $SOURCE ને $TARGET_PATH ચલાવવાથી નામંજૂર કરેલ છે. જો $SOURCE એ $TARGET_PATH ને ચલાવવા માટે સમર્થ હોવું જોઈએ, તો આ લેબલીંગ સમસ્યા હોઈ શકે. મોટા ભાગના શુદ્ધિ થયેલ ડોમેઈનો ફાઈલોને bin_t લેબલવાળી ફાઈલો ચલાવવા માટે માન્ય છે. તેથી તમે આ ફાઈલ પરનું લેબલીંગ bin_t માં બદલી શકો છો અને કાર્યક્રમનો પુનઃપ્રયાસ કરી શકો છો. જો આ $SOURCE એ $TARGET_PATH ચલાવતો હોવો જોઈએ નહિં, તો આ ઘૂંસણખોરી પ્રયાસનો સંકેત આપી શક્યું હશે.

source: If you want to allow $SOURCE to execute $TARGET_PATH: chcon -t bin_t '$TARGET_PATH' If this fix works, please update the file context on disk, with the following command: semanage fcontext -a -t bin_t '$TARGET_PATH' Please specify the full path to the executable, Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this selinux-policy to make sure this becomes the default labeling.
gu: જો તમે $SOURCE ને $TARGET_PATH ચલાવવાની પરવાનગી આપવા માંગો: chcon -t bin_t '$TARGET_PATH' જો આ ઉકેલ કામ કરે, તો મહેરબાની કરીને ડિસ્ક પરનો ફાઈલ સંદર્ભ સુધારો, નીચેના આદેશ વડે: semanage fcontext -a -t bin_t '$TARGET_PATH' મહેરબાની કરીને એક્ઝેક્યુટેબલનો આખો પાથ સ્પષ્ટ કરો, મહેરબાની કરીને selinux-policy વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલ અહેવાલ</a> જમા કરો એ ખાતરી કરવા માટે આ મૂળભૂત લેબલીંગ બને.

source: SELinux prevented $SOURCE from accessing the cron spool file.
gu: SELinux એ $SOURCE ને cron સ્પુલ ફાઈલ વાપરવાથી બચાવેલ છે.

source: SELinux prevented $SOURCE from accessing the cron spool file. This is access is normally needed when using fcron as a cron daemon (<a href="http://fcron.free.fr/">http://fcron.free.fr</a>). If you are using fcron you should allow this access. Otherwise this access attempt may signal an intrusion attempt.
gu: SELinux એ $SOURCE ને cron spool ફાઈલનો વપરાશ કરવાથી બચાવેલ છે. આ વપરાશ સામાન્ય રીતે જરૂરી છે જ્યારે fcron ને cron ડિમન તરીકે વાપરી રહ્યા હોય (<a href="http://fcron.free.fr/">http://fcron.free.fr</a>). જો તમે fcron વાપરી રહ્યા હોય તો તમને આ વપરાશ માન્ય હોવો જોઈએ. નહિંતર આ વપરાશ લેવાનું ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શકશે.

source: SELinux is preventing access to files with the label, file_t.
gu: SELinux એ file_t લેબલ સાથેની ફાઈલોના વપરાશથી બચાવી રહ્યું છે.

source: SELinux permission checks on files labeled file_t are being denied. file_t is the context the SELinux kernel gives to files that do not have a label. This indicates a serious labeling problem. No files on an SELinux box should ever be labeled file_t. If you have just added a new disk drive to the system you can relabel it using the restorecon command. Otherwise you should relabel the entire files system.
gu: SELinux પરવાનગી file_t લેબલવાળી ફાઈલો પર ચકાસણી કરે છે કે જે નામંજૂર થઈ ગયેલ છે. file_t એ સંદર્ભ છે કે જે SELinux કર્નલ ફાઈલોને આપે છે કે જેની પાસે લેબલ નથી. આ ગંભીર લેબલીંગ સમસ્યાને સૂચવે છે. SELinux બોક્સ પરની કોઈપણ ફાઈલો ક્યારેય file_t લેબલ થયેલ હોવી જોઈએ નહિં. જો તમે હમણાં જ નવી ડિસ્ક ડ્રાઈવને સિસ્ટમ ઉમેરેલ હોય તો તમે તેને restorecon આદેશની મદદથી પુનઃલેબલ કરી શકો છો. નહિંતર તમારે વર્તમાન ફાઈલસિસ્ટમ પુનઃલેબલ કરવી જોઈએ.

source: You can execute the following command as root to relabel your computer system: "touch /.autorelabel; reboot"
gu: તમે તમારી કમ્પ્યૂટર સિસ્ટમનું પુનઃલેબલીકરણ કરવા માટે નીચેનો આદેશ રુટ તરીકે ચલાવી શકો છો: "touch /.autorelabel; reboot"

source: SELinux is preventing $SOURCE from creating a file with a context of $SOURCE_TYPE on a filesystem.
gu: SELinux એ $SOURCE ને ફાઈલસિસ્ટમ પર $SOURCE_TYPE ના સંદર્ભ સાથે ફાઈલ બનાવવાથી અટકાવી રહ્યું છે.

source: SELinux is preventing $SOURCE from creating a file with a context of $SOURCE_TYPE on a filesystem. Usually this happens when you ask the cp command to maintain the context of a file when copying between file systems, "cp -a" for example. Not all file contexts should be maintained between the file systems. For example, a read-only file type like iso9660_t should not be placed on a r/w system. "cp -P" might be a better solution, as this will adopt the default file context for the destination.
gu: SELinux એ $SOURCE ને ફાઈલસિસ્ટમ પર $SOURCE_TYPE ના સંદર્ભ સાથે ફાઈલ બનાવવાથી અટકાવી રહ્યું છે. સામાન્ય રીતે આ થાય છે જો તમે cp આદેશને ફાઈલનો સંદર્ભ જાળવવા માટે કહો જ્યારે ફાઈલ સિસ્ટમો વચ્ચે ફાઈલોની નકલ કરી રહ્યા હોય. ઉદાહરણ તરીકે "cp -a". ફાઈલ સિસ્ટમો વચ્ચે બધા ફાઈલ સંદર્ભ જળવાવા જોઈએ નહિં. ઉદાહરણ તરીકે iso9660_t જેવો માત્ર વાંચી શકાય તેવો ફાઈલ પ્રકાર r/w સિસ્ટમ પર મૂકવામાં આવવો જોઈએ. cp -P એ કદાચ વધુ સારો ઉકેલ હોઈ શકે, કારણ કે આ અંતિમ મુકામ માટે મૂળભૂત ફાઈલ સંદર્ભ સ્વીકારી લેશે.

source: Use a command like "cp -P" to preserve all permissions except SELinux context.
gu: SELinux સંદર્ભ સિવાયની બધી પરવાનગીઓ સાચવવા માટે "cp -P" જેવો આદેશ વાપરો.

source: SELinux prevented $SOURCE from correctly running as a daemon.
gu: SELinux એ $SOURCE ને ડિમન તરીકે યોગ્ય રીતે ચલાવવાથી બચાવેલ છે.

source: SELinux prevented $SOURCE from correctly running as a daemon. Ftp servers can be configured to either run through xinetd or as a stand-alone daemon. Each configuration requires slightly different access. If you have configured your ftp server to run as a daemon you should allow this access. Otherwise this may signal an intrusion attempt.
gu: SELinux એ $SOURCE ને વર્તમાનમાં ડિમન તરીકે યોગ્ય રીતે ચલવાથી બચાવેલ છે. Ftp સર્વરો ક્યાં તો xinetd મારફતે ચલાવવા માટે અથવા એકલા ડિમન તરીકે ચલાવવા માટે રૂપરેખાંકિત કરી શકાય છે. દરેક રૂપરેખાંકન માટે થોડા અલગ વપરાશની જરૂર હોય છે. જો તમે તમારું ftp સર્વરને ડિમન તરીકે ચલાવવા માટે રૂપરેખાંકિત કરેલ હોય તો તમારે આ વપરાશને પરવાનગી આપવી જોઈએ. નહિંતર આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપશે.

source: SELinux is preventing the ftp daemon from reading users home directories ($TARGET_PATH).
gu: SELinux એ ftp ડિમનને વપરાશકર્તાઓ ઘર ડિરેક્ટરીઓ ($TARGET_PATH) વાંચવાથી બચાવી રહ્યું છે.

source: SELinux has denied the ftp daemon access to users home directories ($TARGET_PATH). Someone is attempting to login via your ftp daemon to a user account. If you only setup ftp to allow anonymous ftp, this could signal a intrusion attempt.
gu: SELinux એ વપરાશકર્તાઓની ઘર ડિરેક્ટરીઓ ($TARGET_PATH) માં ftp ડિમન વપરાશની મનાઈ કરી છે. કોઈક તમારા ftp ડિમન મારફતે વપરશકર્તા ખાતામાં પ્રવેશવાનો પ્રયાસ કરી રહ્યું છે. જો તમે અનામિક ftp વપરાશને પરવાનગી આપવા માટે માત્ર ftp સુયોજિત કરો, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want ftp to allow users access to their home directories you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે ftp ને વપરાશકર્તાઓને તેમની ઘર ડિરેક્ટરી વાપરવા માટે પરવાનગી આપો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux prevented $SOURCE from reading from the urandom device.
gu: SELinux એ $SOURCE_NAME ને urandom ઉપકરણમાંથી વાંચવાથી બચાવેલ છે.

source: SELinux prevented $SOURCE from reading from the urandom device. This access should be allowed for individual applications, but there are situations where all applications require the access (for example, when ProPolice/SSP stack smashing protection is used). Allowing this access may allow malicious applications to drain the kernel entropy pool. This can compromising the ability of some software that is dependent on high quality random number (e.g., ssh-keygen) to operate effectively. The risk of this type of attack is relatively low.
gu: SELinux એ $SOURCE_NAME ને urandom ઉપકરણમાંથી વાંચવાથી બચાવેલ છે. આ વપરાશ વ્યક્તિગત કાર્યક્રમો માટે માન્ય હોવો જોઈએ, પરંતુ ત્યાં પરિસ્થિતિઓ છે કે જ્યાં બધા કાર્યક્રમોને વપરાશ જરૂરી છે (ઉદાહરણ તરીકે, કે જ્યાં ProPolice/SSP સ્ટેક સ્મેશીંગ સુરક્ષા વપરાય છે). આ વપરાશને પરવાનગી આપવાનું મલીન કાર્યક્રમોને કર્નલ એન્ટ્રોપી પુલ સાચવવાની પરવાનગી આપી શકશે. આ અમુક સોફ્ટવેરની સક્ષમતાને નબળી પાડી શકે છે કે જે ઉચ્ચ ગુણવત્તા રેન્ડમ નંબર (દા.ત., ssh-keygen) ને યોગ્ય રીતે કામ કરવા માટે આધારભૂત છે. આ પ્રકારના હુમલાનું જોખમ સંબંધિત રીતે ઓછું છે.

source: SELinux is preventing the $SOURCE from using potentially mislabeled files $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ $SOURCE ને સંભવિત રીતે ખોટી રીતે લેબલ થયેલ ફાઈલો $TARGET_PATH ($TARGET_TYPE) વાપરવાથી બચાવી રહ્યું છે.

source: SELinux has denied the $SOURCE access to potentially mislabeled files $TARGET_PATH. This means that SELinux will not allow httpd to use these files. Many third party apps install html files in directories that SELinux policy cannot predict. These directories have to be labeled with a file context which httpd can access.
gu: SELinux એ $SOURCE વપરાશને સંભવિત ખોટી રીતે લેબલ થયેલ ફાઈલોનો $TARGET_PATH માટે નામંજૂર કર્યો છે. આનો અર્થ એ થાય કે SELinux એ http ને આ ફાઈલો વાપરવા માટે પરવાનગી આપશે નહિં. ઘણા ત્રીજી વ્યક્તિ કાર્યક્રમો html ફાઈલોને ડિરેક્ટરીઓમાં સ્થાપિત કરે છે કે જેની SELinux પોલિસી ધારણા કરી શકે નહિં. આ ડિરેક્ટરીઓ ફાઈલ સંદર્ભ સાથે લેબલ થયેલ હોવી જોઈએ કે જેને httpd વાપરી શકે.

source: If you want to change the file context of $TARGET_PATH so that the httpd daemon can access it, you need to execute it using chcon -t httpd_sys_content_t '$TARGET_PATH'. You can look at the httpd_selinux man page for additional information.
gu: જો તમે $TARGET_PATH નો ફાઈલ સંદર્ભ બદલવા માંગો કે જેથી httpd ડિમન તેને વાપરી શકે, તો તમારે તેને chcon -t httpd_sys_content_t '$TARGET_PATH' ની મદદથી ચલાવવાની જરૂર છે. તમે વધારાની જાણકારી માટે httpd_selinux આગળ જોઈ શકો છો.

source: SELinux is preventing the http daemon from using built-in scripting.
gu: SELinux એ http ડિમનને આંતરિક સ્ક્રિપ્ટિંગ વાપરવાથી બચાવી રહ્યું છે.

source: SELinux has denied the http daemon from using built-in scripting. This means that SELinux will not allow httpd to use loadable modules to run scripts internally. If you did not setup httpd to use built-in scripting, this may signal a intrusion attempt.
gu: SELinux એ http ડિમનને આંતરિક સ્ક્રિપ્ટીંગ વાપરવાથી મનાઈ કરેલ છે. આનો અર્થ એ થાય કે SELinux એ httpd ને લોડ કરી શકાય તેવા મોડ્યુલોને સ્ક્રિપ્ટો આંતરિક રીતે વાપરવા માટે પરવાનગી આપશે નહિં. જો તમે આંતરિક સ્ક્રિપ્ટીંગ વાપરવા માટે httpd સુયોજિત કર્યું નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want the http daemon to use built in scripting you need to enable the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે http ડિમનને આંતરિક સ્ક્રિપ્ટિંગ વાપરવા માટે ઈચ્છો તો તમારે $BOOLEAN બુલિયન સક્રિય કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from connecting to a database.
gu: SELinux એ http ડિમનને ડેટાબેઝ સાથે જોડાવાથી બચાવી રહ્યું છે.

source: SELinux has denied the http daemon from connecting to a database. An httpd script is trying to connect to a database port. If you did not setup httpd to allow database connections, this could signal a intrusion attempt.
gu: SELinux એ http ડિમનને ડેટાબેઝ સાથે જોડાવાથી નામંજૂર કરેલ છે. httpd સ્ક્રિપ્ટ એ ડેટાબેઝ પોર્ટ સાથે જોડાવાનો પ્રયાસ કરી રહી છે. જો તમે httpd ને ડેટાબેઝ જોડાણોની પરવાનગી આપવા માટે સુયોજિત નહિં કરેલ હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want httpd to allow database connections you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે httpd ને ડેટાબેઝ જોડાણોને પરવાનગી આપવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર નથી: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from connecting to network port $PORT_NUMBER
gu: SELinux એ http ડિમનને નેટવર્ક પોર્ટ $PORT_NUMBER પર જોડાવાથી બચાવી રહ્યું છે

source: SELinux has denied the http daemon from connecting to $PORT_NUMBER. An httpd script is trying to do a network connect to a remote port. If you did not setup httpd to network connections, this could signal a intrusion attempt.
gu: SELinux એ http ડિમનને $PORT_NUMBER સાથે જોડાવા માટે નામંજૂર કરેલ છે. httpd સ્ક્રિપ્ટ એ દૂરસ્થ પોર્ટની મદદથી નેટવર્કમાં જોડાવાનો પ્રયત્ન કરી રહી છે. જો તમે httpd ને નેટવર્ક જોડાણો સાથે સુયોજિત કરેલ નહિં હોય, તો ઘૂંસણખોરી પ્રવેશનો સંકેત કરી શક્યું હોત.

source: If you want httpd to connect to network ports you need to turn on the httpd_can_network_network_connect boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે httpd ને નેટવર્ક પોર્ટો સાથે જોડાવા માંગો તો તમારે httpd_can_network_network_connect બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from connecting to the itself or the relay ports
gu: SELinux એ http ડિમનને પોતાની સાથે અથવા રીલે પોર્ટો સાથે જોડવાથી બચાવી રહ્યું છે

source: SELinux has denied the http daemon from connecting to itself or the relay ports. An httpd script is trying to do a network connect to an http/ftp port. If you did not setup httpd to network connections, this could signal a intrusion attempt.
gu: SELinux એ http ડિમનને પોતાની સાથે જોડાવા માટે અથવા રીલે પોર્ટો સાથે જોડાવા નામંજૂર કરેલ છે. httpd સ્ક્રિપ્ટ એ http/ftp પોર્ટ સાથે નેટવર્ક જોડાણ કરવાનો પ્રયત્ન કરી રહ્યું છે. જો તમે httpd ને નેટવર્ક જોડાણો માટે સુયોજિત કરેલ નહિં હોય, તો ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want httpd to connect to httpd/ftp ports you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે httpd ને httpd/ftp પોર્ટો સાથે જોડવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from executing cgi scripts.
gu: SELinux એ http ડિમનને cgi સ્ક્રિપ્ટો ચલાવવાથી અટકાવી રહ્યું છે

source: SELinux has denied the http daemon from executing a cgi script. httpd can be setup in a locked down mode where cgi scripts are not allowed to be executed. If the httpd server has been setup to not execute cgi scripts, this could signal a intrusion attempt.
gu: SELinux એ http ડિમનને cgi સ્ક્રિપ્ટ ચલાવવાથી નામંજૂર કરેલ છે. httpd એ તાળું મરાયેલ સ્થિતિમાં સુયોજિત કરી શકાય છે કે જ્યાં cgi સ્ક્રિપ્ટોને ચલાવવા માટે પરવાનગી નથી. જો httpd સર્વર cgi સ્ક્રિપ્ટો નહિં ચલાવવા માટે સુયોજિત થઈ ગયેલ હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want httpd to be able to run cgi scripts, you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે httpd ને cgi સ્ક્રિપ્ટો ચલાવવામાં સમર્થ કરવા માંગો, તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from acting as a ftp server.
gu: SELinux એ http ડિમનને ftp સર્વર તરીકે વર્તવાથી બચાવી રહ્યું છે.

source: SELinux has denied the http daemon from listening for incoming connections on the ftp port. This means that SELinux will not allow httpd to run as a ftp server. If you did not setup httpd to run as a ftp server, this may signal a intrusion attempt.
gu: SELinux એ http ડિમનને ftp પોર્ટ પર આવી રહેલ જોડાણો માટે સાંભળવા માટે નામંજૂર કરેલ છે. આનો અર્થ એ થાય કે SELinux એ httpd ને ftp સર્વર તરીકે ચલાવવા માટે પરવાનગી આપશે નહિં. જો તમે httpd ને ftp સર્વર તરીકે ચલાવવા માટે સુયોજિત કરેલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want the http daemon to listen on the ftp port, you need to enable the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે http ડિમનને ftp પોર્ટ પર સાંભળવા માંગો, તો તમારે $BOOLEAN બુલિયન સક્રિય કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from reading users' home directories.
gu: SELinux એ http ડિમનને વપરાશકર્તાઓ ઘર ડિરેક્ટરીઓ વાંચવાથી બચાવી રહ્યું છે.

source: SELinux has denied the http daemon access to users' home directories. Someone is attempting to access your home directories via your http daemon. If you have not setup httpd to share home directories, this probably signals a intrusion attempt.
gu: SELinux એ http ડિમનને વપરાશકર્તાઓની ઘર ડિરેક્ટરીઓનો વપરાશ કરવા માટે મનાઈ કરેલ છે. કોઈક તમારી ઘર ડિરેક્ટરીઓને http ડિમન મારફતે વાપરવાનો પ્રયાસ કરી રહ્યું છે. જો તમે httpd ને ઘર ડિરેક્ટરીઓ વહેંચવા માટે સુયોજિત કરેલ નહિં હોય, તો આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત આપે.

source: If you want the http daemon to share home directories you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે $BOOLEAN બુલિયન ચાલુ કરવા માટે ઘર ડિરેક્ટરીઓ વહેંચવા માટે http ડિમન ચાલુ કરવા માંગો: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from executing a shell script
gu: SELinux એ http ડિમનને શેલ સ્ક્રિપ્ટ ચલાવવાથી બચાવી રહ્યું છે

source: SELinux has denied the http daemon from executing a shell script. Ordinarily, httpd requires that all scripts (CGIs) be labeled httpd_sys_script_exec_t. If httpd should not be running this shell script, this could signal a intrusion attempt.
gu: SELinux એ http ડિમનને શેલ સ્ક્રિપ્ટો ચલાવવાથી નામંજૂર કરી નાંખેલ છે. સામાન્ય રીતે, httpd માટે જરૂરી છે કે બધી સ્ક્રિપ્ટો (CGIs) httpd_sys_script_exec_t થી લેબલ થયેલ હોવી જોઈએ. જો httpd એ આ શેલ સ્ક્રિપ્ટ ચલાવી રહી નહિં હોય, તો ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want httpd to be able to run a particular shell script, you can label it with chcon -t httpd_sys_script_exec_t SCRIPTFILE. If you want httpd to be able execute any shell script you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે httpd ને ચોક્કસ શેલ સ્ક્રિપ્ટ ચલાવવા માટે સમર્થ બનાવવા માંગો, તો તમે તેને chcon -t httpd_sys_script_exec_t SCRIPTFILE ની મદદથી લેબલ આપી શકો. જો તમે httpd ને કોઈપણ શેલ સ્ક્રિપ્ટ ચલાવવા માટે સમર્થ બનાવવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની જરૂર છે: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the http daemon from communicating with the terminal.
gu: SELinux એ http ડિમનને ટર્મિનલ સાથે સંપર્કવ્યવહાર કરવાથી બચાવી રહ્યું છે.

source: SELinux is not allowing the http daemon to communicate with the terminal. Most daemons do not need to communicate with the terminal. httpd can be setup to require information during the boot process which would require this access. If you did not setup httpd to requires access to the terminal, this may signal a intrusion attempt.
gu: SELinux એ http ડિમનને ટર્મિનલ સાથે સંપર્કવ્યવહાર કરવાથી પરવાનગી આપતું નથી. મોટા ભાગના સેવા ડિમનોએ ક્યારેય ટર્મિનલ સાથે સંપર્કવ્યવહાર કરવો જોઈએ નહિં. httpd બુટ પ્રક્રિયા દરમ્યાન જરૂરીયાત મેળવવા માટે સુયોજિત કરી શકાય છે કે જેને આ વપરાશ જરૂરી રહેશે. જો તમે httpd ને સુયોજિત કરેલ નહિં હોય ટર્મિનલનો વપરાશ કરવા માટે, તો આ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want the http daemon to be able to access the terminal, you must set the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે http ડિમનને ટર્મિનલનો વપરાશ કરવા માટે સમર્થ બનાવવા માંગો તો તમારે $BOOLEAN બુલિયન સુયોજિત કરવું જ પડશે: "setsebool -P $BOOLEAN=1"

source: SELinux prevented httpd $ACCESS access to http files.
gu: SELinux એ httpd $ACCESS વપરાશ http ફાઈલોથી બચાવેલ છે.

source: SELinux prevented httpd $ACCESS access to http files. Ordinarily httpd is allowed full access to all files labeled with http file context. This machine has a tightened security policy with the $BOOLEAN turned off, this requires explicit labeling of all files. If a file is a cgi script it needs to be labeled with httpd_TYPE_script_exec_t in order to be executed. If it is read-only content, it needs to be labeled httpd_TYPE_content_t, it is writable content. it needs to be labeled httpd_TYPE_script_rw_t or httpd_TYPE_script_ra_t. You can use the chcon command to change these contexts. Please refer to the man page "man httpd_selinux" or <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" refers to one of "sys", "user" or "staff" or potentially other script types.
gu: SELinux એ httpd $ACCESS વપરાશ http ફાઈલોથી બચાવેલ છે. સામાન્ય રીતે httpd ને http ફાઈલ સંદર્ભથી લેબલ થયેલ બધી ફાઈલોનો પૂરેપૂરો વપરાસ માન્ય છે. આ મશીને $BOOLEAN ને બંધ કરીને સુરક્ષા નીતિ મજબૂત કરેલ છે, આના માટે બધી ફાઈલોનું બાહ્ય લેબલીંગ જરૂરી છે. જો ફાઈલ એ cgi સ્ક્રિપ્ટ હોય તો તેને ચલાવવા માટે httpd_TYPE_script_exec_t લેબલ થયેલ હોવું જોઈએ. જો તે માત્ર વાંચી શકાય તેવું સમાવિષ્ટ હોય, તો તેને httpd_TYPE_content_t લેબલ કરવું જોઈએ, તે લખી શકાય તેવો સમાવિષ્ટ છે. તેને httpd_TYPE_script_rw_t અથવા httpd_TYPE_script_ra_t લેબલ હોવું જોઈએ. તમે chcon આદેશને આ સંદર્ભ બદલવા માટે વાપરી શકો છો. મહેરબાની કરીને મદદ પાનાંનો સંદર્ભ લો "man httpd_selinux" અથવા <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" એ "sys", "user" અથવા "staff" માંથી એક અથવા સંભવિતપણે અન્ય સ્ક્રિપ્ટ પ્રકારોનો સંદર્ભ આપે છે.

source: SELinux prevented the http daemon from $ACCESS files stored on a CIFS filesytem.
gu: SELinux એ ftp ડિમનને $ACCESS ફાઈલો કે જે CIFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ છે તેનાથી બચાવેલ છે.
