Repository: pbrezina/my-scripts
Catalog: po/*.po
Languages: gu, uk_ua

source: SELinux prevented $SOURCE from using kerberos for authentication. If you have configured the system to use kerberos this access is expected but is not currently allowed by SELinux. Otherwise this access may signal an intrusion.
gu: SELinux એ $SOURCE ને સત્તાધિકરણ માટે કર્બરોઝ વાપરવાથી બચાવેલ છે. જો તમે કર્બરોઝ વાપરવા માટે સિસ્ટમ રૂપરેખાંકિત કરેલ હોય તો આ વપરાશ ઈચ્છનીય છે પરંતુ તે વર્તમાનમાં SELinux દ્વારા માન્ય નથી. નહિંતર આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શકશે.

source: SELinux prevented $SOURCE from mounting on the file or directory "$TARGET_PATH" (type "$TARGET_TYPE").
gu: SELinux એ $SOURCE ને "$TARGET_PATH" ("$TARGET_TYPE" લખો) ફાઈલ અથવા ડિરેક્ટરી પર માઉન્ટ કરવાથી બચાવ્યું છે.

source: SELinux prevented $SOURCE from mounting a filesystem on the file or directory "$TARGET_PATH" of type "$TARGET_TYPE". By default SELinux limits the mounting of filesystems to only some files or directories (those with types that have the mountpoint attribute). The type "$TARGET_TYPE" does not have this attribute. You can either relabel the file or directory or set the boolean "$BOOLEAN" to true to allow mounting on any file or directory.
gu: SELinux એ $SOURCE ને "$TARGET_PATH" પર "$TARGET_TYPE" પ્રકારની ડિરેક્ટરી અથવા ફાઈલ પર ફાઈલસિસ્ટમ માઉન્ટ કરવાથી બચાવેલ છે. મૂળભૂત રીતે SELinux એ માત્ર અમુક ફાઈલો અથવા ડિરેક્ટરીઓ પર જ ફાઈલસિસ્ટમ માઉન્ટ કરવાની મર્યાદા મૂકે છે (કે જેઓ અમુક પ્રકારની હોય જેમને માઉન્ટ બિંદુ લક્ષણ હોય). "$TARGET_TYPE" પ્રકારને આ લક્ષણ હોતું નથી. તમે ક્યાં તો ફાઈલ અથવા ડિરેક્ટરીનું પુનઃલેબલીકરણ કરી શકો અથવા "$BOOLEAN" બુલિયનને કોઈપણ ફાઈલ અથવા ડિરેક્ટરી પર માઉન્ટીંગની પરવાનગી આપવા માટે ખરા તરીકે સુયોજિક કરી શકો છો.

source: File System
gu: ફાઈલ સિસ્ટમ

source: SELinux prevented a mplayer plugin ($SOURCE_TYPE) from making the stack executable.
gu: SELinux એ mplayer પ્લગઈન ($SOURCE_TYPE) ને સ્ટેક એક્ઝેક્યુટ કરી શકાય તેવો બનાવવાથી અટકાવ્યું હતું.

source: SELinux prevented the mplayer plugin ($SOURCE_TYPE) from making the stack executable. An executable stack should not be required by any software (see <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> for more information). However, some versions of the mplayer plugin are known to require this access to work properly. You should check for updates to the software before allowing this access.
gu: SELinux એ mplayer પ્લગઈનને ($SOURCE_TYPE) સ્ટેક એક્ઝેક્યુટેબલ બનાવવાથી બચાવેલ છે. એક્ઝેક્યુટેબલ સ્ટેક કોઈપણ સોફ્ટવેર દ્વારા જરૂરી હોવું જોઈએ નહિં (વધુ જાણકારી માટે <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux મેમરી સુરક્ષા ચકાસણીઓ</a> જુઓ). છતાં, Java પ્લગઈનની અમુક આવૃત્તિઓ આ વપરાશ પર યોગ્ય રીતે કામ કરવા માટે જાણીતી છે. આ વપરાશની પરવાનગી આપવા પહેલાં તમારે સોફ્ટવેર માટેના સુધારાઓની ચકાસણી કરવી જોઈએ.

source: Media
gu: મીડિયા

source: SELinux is preventing the nfs daemon from allowing clients to write to public directories.
gu: SELinux એ nfs ડિમનને ક્લાઈન્ટોને જાહેર ડિરેક્ટરીઓમાં લખવાની પરવાનગી આપવાથી બચાવી રહ્યું છે.

source: SELinux has preventing the nfs daemon (nfsd) from writing to directories marked as public. Usually these directories are shared between multiple network daemons, like nfs, apache, ftp etc. If you have not exported any public file systems for writing, this could signal an intrusion.
gu: SELinux એ nfs ડિમનને (nfsd) જાહેર તરીકે ચિહ્નિત થયેલ ડિરેક્ટરીઓ પર લખવાથી બચાવી રહ્યું છે. સામાન્ય રીતે આ ડિરેક્ટરીઓ વિવિધ નેટવર્ક ડિમનો જેમ કે nfs, apache, ftp, વગેરે વચ્ચે વહેંચાયેલ છે. જો તમે લખવા માટે કોઈપણ જાહેર ફાઈલ સિસ્ટમોની નિકાસ કરેલ નહિં હોય, તો આ ઘૂંસણખોરીનો સંકેત આપી શક્યું હોત.

source: If you want to export a public file systems using nfs you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1".
gu: શું તમે nfs ફાઈલ સિસ્ટમની મદદથી જાહેર ફાઈલ સિસ્ટમોનો નિકાસ કરવા માંગો કે જે તમને $BOOLEAN બુલિયન ચાલુ કરવા જરૂરી હોય: "setsebool -P $BOOLEAN=1".

source: SELinux prevented $SOURCE from $ACCESS files stored mail spool directory.
gu: SELinux એ NFS ફાઈલસિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી $SOURCE ને બચાવેલ છે.

source: SELinux prevented $SOURCE from $ACCESS files stored in the mail spool directory. $SOURCE attempted to write one or more files or directories, postfix ordinarily does not need this access. However it can be setup to allow this. If you have not configured $SOURCE to write to the mail spool this access attempt could signal an intrusion attempt.
gu: SELinux એ Windows SMB/CIFS (Samba) ફાઈલ સિસ્ટમ પર સંગ્રહાયેલ $ACCESS ફાઈલોથી $SOURCE ને બચાવેલ છે. CIFS એ Windows સિસ્ટમો પર સામાન્ય રીતે વાપરવામાં આવતી નેટવર્ક ફાઈલસિસ્ટમ છે. $SOURCE એ આ પ્રકારની માઉન્ટ થયેલ ફાઈલસિસ્ટમમાંથી એક અથવા વધુ ફાઈલો અથવા ડિરેક્ટરીઓ વાંચવાનું પસંદ કરેલ છે. CIFS ફાઈલસિસ્ટમો સારું SELinux લેબલીંગને આધાર આપતી નહિં હોવાના કારણે, ફાઈલસિસ્ટમમાં સંગ્રહાયેલ બધી ફાઈલો અને ડિરેક્ટરીઓને એકસરખો સુરક્ષા સંદર્ભ હશે. જો તમે $SOURCE ને CIFS ફાઈલસિસ્ટમમાંથી ફાઈલો વાંચવા માટે રૂપરેખાંકિત કરેલ નહિં હોય તો આ વપરાશ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: Mail
gu: મેઈલ

source: SELinux policy is preventing the rsync daemon from writing to a public directory.
gu: SELinux પોલિસી એ rsync ડિમનને જાહેર ડિરેક્ટરીમાં લખવાથી બચાવી રહી છે.

source: SELinux policy is preventing the rsync daemon from writing to a public directory. If rsync is not setup to allow anonymous writes, this could signal a intrusion attempt.
gu: SELinux પોલિસી એ rsync ડિમનને જાહેર ડિરેક્ટરીમાં લખવાથી બચાવી રહી છે. જો rsync એ અનામિક લેખનોને પરવાનગી આપવા માટે સુયોજિત નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If ftp should be allowed to write to this directory you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the rsync_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"
gu: શું ftp આ ડિરેક્ટરીમાં લખવા માટે માન્ય હોવું જોઈએ તો તમારે $BOOLEAN બુલિયનને ચાલુ કરવું જોઈએ અને જાહેર ડિરેક્ટરીનો સંદર્ભ public_content_rw_t માં બદલવો જોઈએ. આગળની જાણકારી માટે rsync_selinux મદદ પાનું વાંચો: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"

source: SELinux is preventing the sasl authentication server from reading the /etc/shadow file.
gu: SELinux એ sasl સત્તાધિકરણ સર્વરને /etc/shadow ફાઈલ વાંચવાથી બચાવી રહ્યું છે.

source: SELinux has denied the sasl authentication daemon from reading the /etc/shadow file. If the sasl authentication daemon (saslauthd) is not setup to read the /etc/shadow, this could signals an intrusion.
gu: SELinux એ sasl સત્તાધિકરણ ડિમનને /etc/shadow ફાઈલ વાંચવાથી નામંજૂર કરેલ છે. જો sasl સત્તાધિકરણ ડિમન (saslauthd) એ /etc/shadow વાંચવા માટે સુયોજિત થયેલ નહિં હોય, તો આ ઘૂંસણખોરીનું સંકેત આપી શક્યું હોત.

source: If you want the sasl authentication daemon to be able to read the /etc/shadow file change the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1".
gu: જો તમને /etc/shadow ફાઈલ વાંચવાની સક્ષમતા માટે sasl સત્તાધિકરણ ડિમનની જરૂર હોય તો $BOOLEAN બુલિયન બદલો: "setsebool -P $BOOLEAN=1".

source: SELinux policy is preventing the samba daemon from writing to a public directory.
gu: SELinux પોલિસી એ samba ડિમનને જાહેર ડિરેક્ટરીમાં લખવાથી બચાવી રહી છે.

source: SELinux policy is preventing the samba daemon from writing to a public directory. If samba is not setup to allow anonymous writes, this could signal a intrusion attempt.
gu: SELinux પોલિસી એ samba ડિમનને જાહેર ડિરેક્ટરીમાં લખવાથી બચાવી રહી છે. જો samba એ અનામિક લેખનોની પરવાનગી આપવા માટે સુયોજિત થયેલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If ftp should be allowed to write to this directory you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the samba_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"
gu: જો ftp આ ડિરેક્ટરી લખવા માટે માન્ય હોવી જોઈએ તો તમારે $BOOLEAN બુલિયન ચાલુ કરવાની અને જાહેર ડિરેક્ટરીનો સંદર્ભ public_content_rw_t માં બદલવાની જરૂર છે. આગળની જાણકારી માટે samba_selinux મદદ પાનું વાંચો: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>"

source: SELinux prevented $SOURCE from using NIS (yp).
gu: SELinux એ $SOURCE ને NIS (yp) વાપરવાથી બચાવેલ છે.

source: SELinux prevented $SOURCE from using NIS (yp) for authentication. If you have configured the system to use NIS this access is expected but is not currently allowed by SELinux. Otherwise this access may signal an intrusion.
gu: SELinux એ $SOURCE ને NIS (yp) ને સત્તાધિકરણ માટે વાપરવાથી બચાવેલ છે. જો તમે સિસ્ટમને NIS વાપરવા માટે રૂપરેખાંકિત કરેલ હોય તો આ વપરાશ ઈચ્છિત છે પરંતુ તે વર્તમાનમાં SELinux દ્વારા માન્ય નથી. નહિંતર આ વપરાશ ઘૂંસણખોરીનો સંકેત આપી શકશે.

source: SELinux is preventing the zebra daemon from writing its configurations files
gu: SELinux એ zebra ડિમનને તેની રૂપરેખાંકન ફાઈલો લખવાથી બચાવી રહ્યું છે

source: SELinux has denied the zebra daemon from writing out its configuration files. Ordinarily, zebra is not required to write its configuration files. If zebra was not setup to write the config files, this could signal a intrusion attempt.
gu: SELinux એ zebra ડિમનને તેની રૂપરેખાંકન ફાઈલો લખવાની મનાઈ કરેલ છે. સામાન્ય રીતે, zebra એ તેની રૂપરેખાંકન ફાઈલો લખવા માટે જરૂરી નથી. જો zebra એ રૂપરેખા ફાઈલો લખવા માટે સુયોજિત કરવામાં આવેલ નહિં હોય, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want to allow zebra to overwrite its configuration you must turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
gu: જો તમે zebra ને તેનું રૂપરેખાંકન ફરીથી લખવા માટે પરવાનગી આપવા માંગો તો તમારે $BOOLEAN બુલિયન ચાલુ કરવું જ જોઈએ: "setsebool -P $BOOLEAN=1"

source: SELinux is preventing the $SOURCE from executing potentially mislabeled files $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ $SOURCE ને સંભવિતપણે ખોટી રીતે લેબલ થયેલ ફાઈલો $TARGET_PATH ($TARGET_TYPE) ચલાવવાથી બચાવી રહ્યું છે.

source: SELinux has denied the $SOURCE from executing potentially mislabeled files $TARGET_PATH. Automounter can be setup to execute configuration files, if $TARGET_PATH is an automount executable configuration file it needs to have a file label of bin_t. If automounter is trying to execute something that it is not supposed to, this could indicate an intrusion attack.
gu: SELinux એ $SOURCE ને સંભવિતપણે ખોટી રીતે લેબલ થયેલ ફાઈલો $TARGET_PATH ચલાવવાથી નામંજૂર કર્યું. રૂપરેખાંકન ફાઈલો ચલાવવા માટે ઓટોમાઉન્ટ કરનાર સુયોજિત કરી શકાય છે, જો $TARGET_PATH એ ઓટોમાઉન્ટ ચલાવી શકાય તેવી રૂપરેખાંકન ફાઈલ હોય તો તેને bin_t નું લેબલ હોવું જોઈએ. જો ઓટોમાઉન્ટ કરનાર કંઈક ચલાવવાનો પ્રયાર કરી રહ્યું હોય કે જે થવું જોઈએ નહિં, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want to change the file context of $TARGET_PATH so that the automounter can execute it you can execute "chcon -t bin_t '$TARGET_PATH'". If you want this to survive a relabel, you need to permanently change the file context: execute "semanage fcontext -a -t bin_t '$TARGET_PATH'". You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t bin_t '$TARGET_PATH'"
gu: જો તમે $TARGET_PATH નો ફાઈલ સંદર્ભ બદલવા માંગો કે જેથી ઓટોમાઉન્ટ કરનાર તેને ચલાવી શકે તો તમે "chcon -t bin_t.$TARGET_PATH" ચલાવી શકો. જો તમે આને પુનઃલેબલ માટે સેવા આપવા માંગો, તો તમારે ફાઈલ સંદર્ભ કાયમ માટે બદલવો પડે, "semanage fcontext -a -t bin_t $TARGET_PATH" ચલાવો. તમારે મૂળભૂત ફાઈલ સંદર્ભ ફાઈલોને સિસ્ટમ પર બદલવી જ પડશે તેમને પૂરા પુનઃલેબલ પર સાચવવા માટે. "semanage fcontext -a -t bin_t '$TARGET_PATH'"

source: File Label
gu: ફાઈલ લેબલ

source: SELinux is preventing the $SOURCE ($SOURCE_TYPE) from binding to port $PORT_NUMBER.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) ને પોર્ટ $PORT_NUMBER સાથે બાંધવાથી બચાવી રહ્યું છે.

source: SELinux has denied the $SOURCE from binding to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE is supposed to be allowed to listen on this port, you can use the semanage command to add this port to a port type that $SOURCE_TYPE can bind to. <i>semanage port -l</i> will list all port types. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against the selinux-policy package. If $SOURCE is not supposed to bind to this port, this could signal a intrusion attempt. If this system is running as an NIS Client, turning on the allow_ypbind boolean, may fix the problem. setsebool -P allow_ypbind=1.
gu: SELinux એ $SOURCE ને નેટવર્ક પોર્ટ $PORT_NUMBER સાથે બાંધવાથી નામંજૂર કરેલ છે કે જેને તેની સાથે SELinux પ્રકાર સંકળાયેલ નથી. જો $SOURCE એ આ પોર્ટ પર સાંળળવા માટે માન્ય હોવો જોઈએ, તો તમે આ પોર્ટને પ્રકારમાં ઉમેરવા માટે semanage આદેશ વાપરી શકો કે જેની સાથે $SOURCE_TYPE બંધાઈ શકે. <i>semanage port -L</i> બધા પોર્ટ પ્રકારોને સાંભળશે. selinux-policy પેકેજ વિરુદ્ધ મહેરબાની કરીને <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો. જો $SOURCE એ આ પોર્ટ સાથે બંધાયેલ હોવું જોઈએ નહિં, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત. જો આ સિસ્ટમ NIS ક્લાઈન્ટ તરીકે ચાલી રહી હોય, તો allow_ypbind બુલિયન ચાલુ કરવા પર, સમસ્યા ઉકેલાવી જોઈએ. setsebool -P allow_ypbind=1.

source: If you want to allow $SOURCE to bind to this port semanage port -a -t PORT_TYPE -p PROTOCOL $PORT_NUMBER Where PORT_TYPE is a type that $SOURCE_TYPE can bind and PROTOCOL is udp or tcp.
gu: જો તમે $SOURCE ને આ પોર્ટ સાથે બાંધવા માટે પરવાનગી આપવા માંગો semanage port -a -t PORT_TYPE $PORT_NUMBER જ્યાં PORT_TYPE એ પ્રકાર છે કે જેને $SOURCE_TYPE બાંધી શકે છે.

source: Network Ports
gu: નેટવર્ક પોર્ટ

source: SELinux is preventing $SOURCE ($SOURCE_TYPE) "$ACCESS" $TARGET_TYPE.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) "$ACCESS" $TARGET_TYPE થી બચાવી રહ્યું છે.

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access.
gu: SELinux એ $SOURCE દ્વારા અરજી કરાયેલ વપરાશ નામંજૂર કર્યો છે. તે ઈચ્છિત હતો નહિં કે આ વપરાશ $SOURCE દ્વારા જરૂરી છે અને આ વપરાશ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત કરી શકશે. એ પણ શક્ય છે કે ચોક્કસ આવૃત્તિ અથવા કાર્યક્રમનું રૂપરેખાંકન એ તેને વધારાના વપરાશની અરજી કરવા માટે કારણ આપી રહ્યું હોય.

source: You can generate a local policy module to allow this access - see <a href="http://fedora.redhat.com/docs/selinux-faq-fc5/#id2961385">FAQ</a> Or you can disable SELinux protection altogether. Disabling SELinux protection is not recommended. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this package.
gu: આ વપરાશની પરવાનગી આપવા માટે તમે સ્થાનીય પોલિસી મોડ્યુલ પેદા કરી શકો છો - જુઓ <a href="http://fedora.redhat.com/docs/selinux-faq-fc5/#id2961385">FAQ</a> અથવા તમે SELinux સુરક્ષા એકસાથે નિષ્ક્રિય કરી શકો છો. SELinux સુરક્ષા નિષ્ક્રિય કરવાનું આગ્રહણીય નથી. આ પેકેજ વિરુદ્ધ મહેરબાની કરીને <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો.

source: SELinux is preventing $SOURCE ($SOURCE_TYPE) "$ACCESS" to $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ $SOURCE ($SOURCE_TYPE) "$ACCESS" ને $TARGET_PATH ($TARGET_TYPE) થી બચાવી રહ્યું છે.

source: SELinux denied access requested by $SOURCE. The current boolean settings do not allow this access. If you have not setup $SOURCE to require this access this may signal an intrusion attempt. If you do intend this access you need to change the booleans on this system to allow the access.
gu: SELinux એ $SOURCE દ્વારા અરજી કરાયેલ વપરાશ નામંજૂર કર્યો છે. તે ઈચ્છિત હતો નહિં કે આ વપરાશ $SOURCE દ્વારા જરૂરી છે અને આ વપરાશ કદાચ ઘૂંસણખોરી પ્રવેશનો સંકેત કરી શકશે. એ પણ શક્ય છે કે ચોક્કસ આવૃત્તિ અથવા કાર્યક્રમનું રૂપરેખાંકન એ તેને વધારાના વપરાશની અરજી કરવા માટે કારણ આપી રહ્યું હોય.

source: Confined processes can be configured to to run requiring different access, SELInux provides booleans to allow you to turn on/off access as needed.
gu: શુદ્ધિ થયેલ પ્રક્રિયાઓ જરૂરી અલગ વપરાશ મેળવવા માટે ચલાવીને રૂપરેખાંકિત કરી શકાય છે, SELInux એ તમને જરૂરીયાત પ્રમાણે વપરાશ ચાલુ/બંધ કરવા માટે તમને પરવાનગી આપે છે.

source: Sometimes labeling problems can cause SELinux denials. You could try to restore the default system file context for $TARGET_PATH, <p> restorecon -v '$TARGET_PATH' <p> If this does not work, there is currently no automatic way to allow this access. Instead, you can generate a local policy module to allow this access - see <a href="http://fedora.redhat.com/docs/selinux-faq-fc5/#id2961385">FAQ</a> Or you can disable SELinux protection altogether. Disabling SELinux protection is not recommended. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against this package.
gu: અમુકવાર લેબલીંગ સમસ્યાઓ SELinux denials પેદા કરી શકે છે. તમે $TARGET_PATH માટે મૂળભૂત સિસ્ટમ ફાઈલ સંદર્ભ પુનઃસંગ્રહવાનો પ્રયાસ કરી શકો, restorecon -v '$TARGET_PATH' જો આ કામ નહિં કરે, તો ત્યાં વર્તમાનમાં આ વપરાશને પરવાનગી આપવા માટે કોઈ આપોઆપ માર્ગ નથી. તેની જગ્યાએ, તમે આ વપરાશને પરવાનગી આપવા માટે સ્થાનિક પોલિસી મોડ્યુલ પેદા કરી શકો છો - જુઓ <a href="http://fedora.redhat.com/docs/selinux-faq-fc5/#id2961385">FAQ</a> અથવા તમે SELinux સુરક્ષાને સાથે નિષ્ક્રિય કરી શકો છો. SELinux સુરક્ષા નિષ્ક્રિય કરવાનું આગ્રહણીય નથી. મહેરબાની કરીને આ પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો.

source: SELinux is preventing the $SOURCE ($SOURCE_TYPE) from connecting to port $PORT_NUMBER.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) ને પોર્ટ $PORT_NUMBER સાથે જોડાવાથી બચાવી રહ્યું છે.

source: SELinux has denied the $SOURCE from connecting to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE is supposed to be allowed to connect on this port, you can use the semanage command to add this port to a port type that $SOURCE_TYPE can connect to. <i>semanage port -L</i> will list all port types. Please file a <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">bug report</a> against the selinux-policy package. If $SOURCE is not supposed to bind to this port, this could signal a intrusion attempt.
gu: SELinux એ $SOURCE ને નેટવર્ક પોર્ટ $PORT_NUMBER સાથે જોડાવાથી નામંજૂર કરેલ છે કે જેને SELinux પ્રકાર તેની સાથે સંકળાયેલ નથી. જો $SOURCE એ આ પોર્ટ પર જોડાવા માટે માન્ય હોવું જોઈએ, તો તમે આ પોર્ટને પોર્ટ પ્રકારમાં ઉમેરવા માટે semanage આદેશ વાપરી શકો કે જેને $SOURCE_TYPE જોડાઈ શકે. <i>semanage port -L</i> બધા પોર્ટ પ્રકારોની યાદી આપશે. મહેરબાની કરીને selinux-policy પેકેજ વિરુદ્ધ <a href="http://bugzilla.redhat.com/bugzilla/enter_bug.cgi">ભૂલનો અહેવાલ</a> જમા કરો. જો $SOURCE એ આ પોર્ટ સાથે બંધાવું નહિં જોઈએ, તો આ ઘૂંસણખોરી પ્રવેશનો સંકેત આપી શક્યું હોત.

source: If you want to allow $SOURCE to connect to this port semanage port -a -t PORT_TYPE -p PROTOCOL $PORT_NUMBER Where PORT_TYPE is a type that $SOURCE_TYPE can connect.
gu: જો તમે $SOURCE ને આ પોર્ટ પર જોડાવા માટે પરવાનગી આપવા માંગો semanage port -a -t PORT_TYPE $PORT_NUMBER જ્યાં PORT_TYPE એ પ્રકાર છે કે જેને $SOURCE_TYPE જોડાઈ શકે.

source: SELinux is preventing cvs ($SOURCE) "$ACCESS" to $TARGET_PATH ($TARGET_TYPE).
gu: SELinux એ cvs ($SOURCE) "$ACCESS" ને $TARGET_PATH ($TARGET_TYPE) થી બચાવી રહ્યું છે.

source: SELinux denied cvs access to $TARGET_PATH. If this is a CVS repository it has to have a file context label of cvs_data_t. If you did not intend to use $TARGET_PATH as a cvs repository it could indicate either a bug or it could signal a intrusion attempt.
gu: SELinux એ $TARGET_PATH નો cvs વપરાશ નામંજૂર કર્યો. જો આ CVS રીપોઝીટરી હોય તો તેને cvs_data_t લેબલવાળો ફાઈલ સંદર્ભ હોવો જોઈએ. જો તમે $TARGET_PATH ને cvs રીપોઝીટરી તરીકે વાપરવાનો હેતુ રાખ્યો નહિં હોય તો તે ક્યાં તો ભૂલ સૂચવી શક્યો હોત અથવા તે ઘૂંસણખોરી પ્રવેશ સંકેત સૂચવી શક્યો હોત.

source: You can alter the file context by executing chcon -R -t cvs_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t vcs_data_t '$TARGET_PATH'"
gu: જો તમને $TARGET_PATH ને સ્થાનિક રીતે ચલાવવાનો વિશ્વાસ હોય, તો તમે ફાઈલ સંદર્ભને textrel_shlib_t માં બદલી શકો છો. "chcon -t textrel_shlib_t $TARGET_PATH"

source: SELinux is preventing access to files with the default label, default_t.
gu: SELinux એ મૂળભૂત લેબલ, default_t સાથેની ફાઈલોનો વપરાશથી બચાવી રહ્યું છે.

source: SELinux permission checks on files labeled default_t are being denied. These files/directories have the default label on them. This can indicate a labeling problem, especially if the files being referred to are not top level directories. Any files/directories under standard system directories, /usr, /var. /dev, /tmp, ..., should not be labeled with the default label. The default label is for files/directories which do not have a label on a parent directory. So if you create a new directory in / you might legitimately get this label.
gu: SELinux પરવાનગી default_t લેબલવાળી ફાઈલો ચકાસે છે કે જેઓ નામંજૂર થઈ ગયેલ છે. આ ફાઈલો/ડિરેક્ટરીઓને તેમના પર મૂળભૂત લેબલ છે. આ લેબલીંગ સમસ્યા સૂચવી શકે, ખાસ કરીને જો ફાઈલોનો સંદર્ભ કરવામાં આવેલ હોય કે જે ટોચ સ્તરની ડિરેક્ટરીઓ નહિં હોય. કોઈપણ ફાઈલો/ડિરેક્ટરીઓ સિસ્ટમ ડિરેક્ટરીઓ સમજે છે, /usr, /var. /dev, /tmp, ..., એ મૂળભૂત લેબલથી લેબલ આપવામાં આવેલ હોવી જોઈએ નહિં. ફાઈલો/ડિરેક્ટરીઓ માટે મૂળભૂત લેબલ છે કે જેને પિતૃ ડિરેક્ટરીનું લેબલ નથી. તેથી જો તમે / માં નવી ડિરેક્ટરી બનાવો તો તમે કદાચ નિયમ પ્રમાણે આ લેબલ મેળવો.

source: If you want a confined domain to use these files you will probably need to relabel the file/directory with chcon. In some cases it is just easier to relabel the system, to relabel execute: "touch /.autorelabel; reboot"
gu: જો તમને આ ફાઈલો વાપરવા માટે સુરક્ષિત ડોમેઈનની જરૂર હોય તો તમને કદાચ ફાઈલ/ડિરેક્ટરીને chcon સાથે પુનઃલેબલ કરવાની જરૂર છે. અમુક કિસ્સાઓમાં સિસ્ટમને પુનઃલેબલ કરવાનું સરળ છે, પુનઃલેબલ કરવા આ ચલાવો: "touch /.autorelabel; reboot"

source: SELinux is preventing $SOURCE ($SOURCE_TYPE) "$ACCESS" access to device $TARGET_PATH.
gu: SELinux એ $SOURCE ($SOURCE_TYPE) "$ACCESS" વપરાશને ઉપકરણ $TARGET_PATH થી બચાવી રહ્યું છે.
